// @ts-nocheck

/*

해야할일

스태미너 소모량 등급줘서 9등급까지 한번에 9개씩 소모되게
광고버프 3종
공 방 체 절댓값 중 하나 보너스
공 방 체 보너스 중 하나 보너스
스킬 9종 중 하나 보너스

Ctrl + Shift + P
Developer: Inspect Editor Tokens and Scopes

git add . && git commit -m "배포" && git push origin main

nodemon server.js

npm run d

dev = development(개발)

*/

import { 등급 } from "./공용정의.js";
import { 일반몬스터확률표 } from "./공용정의.js";
import { 히든몬스터확률표 } from "./공용정의.js";
import { 일반몬스터 } from "./공용정의.js";
import { 히든몬스터 } from "./공용정의.js";
import { 유물모음 } from "./공용정의.js";
import { 색상맵 } from "./공용정의.js";
import { 스킬모음 } from "./공용정의.js";
import { 맵핑 } from "./공용정의.js";
import { 유물확률표 } from "./공용정의.js";
import { 삼배수 } from "./공용정의.js";
import { 히든뽑기 } from "./공용정의.js";
import { 버프모음 } from "./공용정의.js";
import { 버프범위 } from "./공용정의.js";
import { 상점모음 } from "./공용정의.js";


document.addEventListener("dragstart", e => e.preventDefault());
document.addEventListener("selectstart", e => e.preventDefault());
document.addEventListener("contextmenu", e => e.preventDefault()); // 우클릭도 막기 옵션

//Health normal
const 더하기 = `<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512" style="height: 512px; width: 512px;"><path d="M0 0h512v512H0z" fill="#000" fill-opacity="1"></path><g class="" transform="translate(0,0)" style=""><path d="M196 16a30 30 0 0 0-30 30v120H46a30 30 0 0 0-30 30v120a30 30 0 0 0 30 30h120v120a30 30 0 0 0 30 30h120a30 30 0 0 0 30-30V346h120a30 30 0 0 0 30-30V196a30 30 0 0 0-30-30H346V46a30 30 0 0 0-30-30H196z" fill="#fff" fill-opacity="1"></path></g></svg>`;
//Batteries icon
const 배터리 = `<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512" style="height: 512px; width: 512px;"><path d="M0 0h512v512H0z" fill="#000" fill-opacity="1"></path><g class="" transform="translate(0,0)" style=""><path d="M168.063 21.844c-25.008 0-47.713 5.09-64.97 13.968-16.938 8.716-29.722 21.962-30.187 38.626h-.03v93.625C59.258 180.325 46.9 197.92 37.75 219.032c-9.94 22.934-14.284 45.82-13 65.187 1.25 18.84 8.173 35.74 23 42.905l.344.156c.302.143.598.274.906.408l23.875 10.343v108.814h.03c.675 16.458 13.396 29.547 30.19 38.187 17.257 8.88 39.97 13.97 64.968 13.97 24.996 0 47.71-5.09 64.968-13.97 16.794-8.64 29.515-21.728 30.19-38.186h.03V420.56l42.844 18.563.22.094 74.56 32.31 7.72 3.345.844.375v-.03c15.48 6.212 32.73-.264 47.468-12.345 15.01-12.302 28.71-31.118 38.656-54.063 9.946-22.944 14.315-45.823 13.032-65.187-1.26-19.01-8.33-36.01-23.438-43.063v-.03l-8.562-3.72L382.03 264.5l-118.78-51.47V76.97c.025-.53.03-1.06.03-1.595 0-.315-.02-.625-.03-.938-.465-16.663-13.248-29.91-30.188-38.624-17.256-8.88-39.992-13.97-65-13.97zM140.25 43.062c.03-.005.064.006.094 0-6.743 3.237-10.906 7.637-10.906 12.5 0 9.93 17.292 17.97 38.625 17.97 21.332 0 38.625-8.04 38.625-17.97 0-4.863-4.164-9.263-10.907-12.5 11.11 2.093 20.927 5.366 28.72 9.376 13.818 7.11 20.094 15.646 20.094 22.937 0 7.29-6.276 15.797-20.094 22.906-13.818 7.11-34.028 11.907-56.438 11.907-22.41 0-42.62-4.797-56.437-11.906-13.818-7.108-20.063-15.614-20.063-22.905 0-7.29 6.245-15.828 20.063-22.938 7.772-3.998 17.554-7.28 28.625-9.374zM72.875 195.656v122l-16.438-7.125c-6.678-2.894-12.003-12.02-13.03-27.53-1.03-15.51 2.593-35.983 11.5-56.53 5.082-11.73 11.316-22.17 17.968-30.814zm171.688 1.75V445.47c0 7.278-6.24 15.825-20.063 22.936-13.822 7.112-34.042 11.906-56.438 11.906-22.395 0-42.615-4.794-56.437-11.906-13.822-7.11-20.063-15.658-20.063-22.937V200.31L145.375 280l-36.844 12.875L229.75 420.25l-51.72-105.78 23.907-11.845-40.156-84.188c2.082.073 4.168.125 6.282.125 24.997 0 47.71-5.09 64.97-13.968 4.134-2.128 8.008-4.537 11.53-7.188zm18.687 36 79 34.25-79 14.78v-49.03zm187.97 82.78c2.094.035 3.983.433 5.655 1.158 6.69 2.9 12.035 12.026 13.063 27.53.577 8.715-.333 18.995-2.813 29.97-.305-7.425-2.682-12.95-7.125-14.875-9.11-3.95-23.39 8.707-31.875 28.28-8.484 19.573-7.953 38.645 1.156 42.594 4.45 1.928 10.12-.104 15.75-4.97-6.316 9.33-13.207 17.023-19.967 22.563-12.02 9.85-22.342 12.18-29.032 9.282-6.688-2.9-12.034-12.027-13.06-27.533-1.03-15.505 2.618-35.94 11.53-56.5 8.912-20.56 21.357-37.21 33.375-47.062 9.014-7.388 17.058-10.537 23.344-10.438zm-153.5 8.658c-.9 1.89-1.78 3.8-2.626 5.75-9.94 22.935-14.315 45.79-13.03 65.156.307 4.65.966 9.173 1.998 13.47l-20.812-9v-74.126l34.47-1.25z" fill="#fff" fill-opacity="1"></path></g></svg>`;
//Battery pack empty icon
const 배터리팩 = `<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512" style="height: 512px; width: 512px;"><path d="M0 0h512v512H0z" fill="#000" fill-opacity="1"></path><g class="" transform="translate(0,0)" style=""><path d="M226 16c-24.93 0-45 13.38-45 30v15h-45c-29.547 0-60 30.453-60 60v315c0 29.547 30.453 60 60 60h240c29.547 0 60-30.453 60-60V121c0-29.547-30.453-60-60-60h-45V46c0-16.62-20.07-30-45-30h-60zm-90 105h240v315H136V121zm120 30v105h-75l75 150V301h75l-75-150z" fill="#fff" fill-opacity="1"></path></g></svg>`;
//Save arrow icon
const 아래화살표 = `<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512" style="height: 512px; width: 512px;"><path d="M0 0h512v512H0z" fill="#000" fill-opacity="1"></path><g class="" transform="translate(0,0)" style=""><path d="M224 30v256h-64l96 128 96-128h-64V30h-64zM32 434v48h448v-48H32z" fill="#fff" fill-opacity="1"></path></g></svg>`;
//Plain arrow icon
const 아래방향 = `<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512" style="height: 512px; width: 512px;"><path d="M0 0h512v512H0z" fill="#000" fill-opacity="1"></path><g class="" transform="translate(0,0)" style=""><path d="M130.81 21.785v245.95H43.84L256 489.382l212.158-221.644H381.19V21.786H130.81z" fill="#fff" fill-opacity="1"></path></g></svg>`;
//Flowers icon
const 플라워 = `<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512" style="height: 512px; width: 512px;"><path d="M0 0h512v512H0z" fill="#000" fill-opacity="1"></path><g class="" transform="translate(0,0)" style=""><path d="M255.688 19.438c-131.508 0-238.313 106.808-238.313 238.312 0 131.504 106.808 238.313 238.313 238.313C387.19 496.063 494 389.257 494 257.75c0-131.504-106.805-238.313-238.313-238.313zm0 18.687c121.407 0 219.625 98.22 219.625 219.625 0 121.407-98.22 219.625-219.625 219.625-121.404 0-219.625-98.22-219.625-219.625 0-121.404 98.217-219.625 219.625-219.625zm.562 20.438c-110.988 0-200.72 89.73-200.72 200.718 0 95.257 66.098 174.875 155 195.533l-3.593-1.188s2.312.576 3.5.563c7.687-.085 14.32-4.367 18.094-10.5 15.59-43.605 18.01-85.436-6.405-103.375-22.6-16.605-66.756-17.003-92.28-40.875C86.304 258.717 86.03 182.03 86.03 182.03c50.518 0 92.432 20.467 123.814 59.595-.12-1.665-.544-3.61-.563-5.28-.703-51.122 45.532-104.533 45.532-104.532 0 0 47.202 48.756 47.907 99.875.055 3.507.36 6.99 0 10.5 28.538-36.8 67.034-60.157 123.217-60.157 0 0-.273 76.687-43.812 117.407-25.32 23.683-69.467 23.692-92.25 40.282-24.086 17.536-22.317 58.325-7.594 101.03.057.16-.073.426 0 .594 3.268 7.82 10.848 13.437 19.845 13.437 88.826-20.713 154.844-100.298 154.844-195.5 0-110.986-89.732-200.717-200.72-200.717zm-.22 191.218c-15.42 7.026-25.842 22.305-25.842 40.345s10.423 33.82 25.843 40.844c15.23-7.1 25.845-22.943 25.845-40.845 0-17.902-10.613-33.244-25.844-40.344z" fill="#fff" fill-opacity="1"></path></g></svg>`;
//To think icon
const 투띵크 = `<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512" style="height: 512px; width: 512px;"><path d="M0 0h512v512H0z" fill="#000" fill-opacity="1"></path><g class="" transform="translate(0,0)" style=""><path d="M431.654 39.256c-7.94 0-15.646 1.078-23.123 3.236-7.398 2.158-14.72 5.435-21.966 9.828v21.735c7.477-5.164 14.645-9.096 21.504-11.793 6.937-2.698 13.45-4.045 19.54-4.045 8.324 0 14.99 2.118 20 6.357 5.088 4.24 7.63 9.79 7.63 16.65 0 3.775-1.002 7.476-3.006 11.098-1.926 3.623-5.087 7.476-9.48 11.56l-10.404 10.292c-6.937 6.628-11.485 12.447-13.643 17.457-2.158 5.01-3.236 11.408-3.236 19.192v17.805h22.08v-14.22c0-4.01.115-7.17.346-9.48.232-2.314.58-4.277 1.04-5.896.618-1.926 1.658-3.89 3.123-5.895 1.54-2.08 4.122-4.934 7.745-8.557l10.174-9.943c6.935-6.63 11.792-12.562 14.567-17.803 2.775-5.318 4.162-10.908 4.162-16.766 0-12.255-4.318-22.12-12.95-29.595-8.556-7.476-19.924-11.214-34.106-11.214zm-253.76 6.365C97.293 45.62 30 127.903 30 231.77c0 47.6 14.142 90.66 37.213 123.353 5.01-2.917 10.87-4.5 17.02-4.005 9.196.74 18.27 5.864 26.245 14.832 18.47 20.77 35.302 33.96 59.48 49.117 62.787-35.66 93.123-76.714 139.263-117.365 2.854-2.516 5.8-4.558 8.777-6.177 5.04-18.706 7.783-38.79 7.783-59.755 0-103.866-67.292-186.147-147.89-186.147zM97.01 146.063c15.177.09 30.255 8.09 43.607 23.764l-13.7 11.674c-11.907-13.977-21.85-18.017-31.802-17.385-9.952.633-21.423 6.88-33.7 18.172L49.228 169.04c13.87-12.76 28.547-21.86 44.743-22.89a43.78 43.78 0 0 1 3.037-.088zm151.96 0a43.78 43.78 0 0 1 3.036.088c16.196 1.03 30.874 10.13 44.744 22.89l-12.186 13.247c-12.278-11.293-23.748-17.54-33.7-18.172-9.953-.632-19.896 3.408-31.802 17.385l-13.7-11.674c13.352-15.674 28.43-23.673 43.607-23.763zm165.803 39.56v29.366h23.47v-29.365h-23.47zm-315.326 7.874c12.646 0 24.26 3.752 33.117 10.36 8.857 6.61 15.106 16.57 15.106 27.912 0 11.342-6.25 21.302-15.106 27.912-8.856 6.61-20.47 10.36-33.117 10.36-12.646 0-24.26-3.75-33.117-10.36-8.856-6.61-15.105-16.57-15.105-27.912 0-11.342 6.25-21.3 15.105-27.91 8.857-6.61 20.47-10.362 33.117-10.362zm156.89 0c12.647 0 24.262 3.752 33.118 10.36 8.857 6.61 15.106 16.57 15.106 27.912 0 11.342-6.248 21.302-15.105 27.912-8.856 6.61-20.47 10.36-33.117 10.36-12.646 0-24.26-3.75-33.117-10.36-8.856-6.61-15.105-16.57-15.105-27.912 0-11.342 6.25-21.3 15.106-27.91 8.857-6.61 20.472-10.362 33.118-10.362zm-160.064 18.12c-7.707.567-14.474 3.155-19.177 6.665-5.34 3.986-7.87 8.663-7.87 13.488 0 4.824 2.53 9.5 7.87 13.486 5.34 3.985 13.335 6.785 22.35 6.785 9.017 0 17.013-2.8 22.353-6.786 5.338-3.985 7.87-8.662 7.87-13.486 0-.09-.006-.177-.008-.266a19.61 19.515 0 0 1-15.506 7.584 19.61 19.515 0 0 1-19.61-19.516 19.61 19.515 0 0 1 1.727-7.955zm156.688.013c-7.623.596-14.31 3.172-18.974 6.65-5.34 3.986-7.87 8.663-7.87 13.488 0 4.824 2.53 9.5 7.87 13.486 5.34 3.985 13.336 6.785 22.352 6.785s17.012-2.8 22.35-6.786c5.34-3.985 7.873-8.662 7.873-13.486 0-.23-.01-.46-.02-.688a19.61 19.515 0 0 1-15.493 7.566 19.61 19.515 0 0 1-19.61-19.515 19.61 19.515 0 0 1 1.524-7.5zm83.263 92.337a11.32 11.32 0 0 0-1.32.012c-3.626.24-8.098 2.217-13.782 7.225-41.548 36.606-72.158 76.506-129.536 112.022l-39.91 26.484-9.953-14.997 12.454-8.264c-22.1-14.347-39.177-28.335-57.145-48.542-5.797-6.518-10.678-8.563-14.24-8.85-3.56-.286-6.562.945-9.528 3.948-5.88 5.95-9.498 19.257-4.2 32.29 12.462 22.93 36.147 44.15 54.038 71.204l1.953 2.95-.582 3.49a521.26 521.26 0 0 0-1.74 11.06h211.452c.103-1.217.18-2.456.193-3.746-.11-4.19-3.22-10.067-8.258-14.563-5.066-4.518-11.74-7.125-15.402-7.032l-12.436.317 3.587-11.91c1.944-6.454.005-14.632-4.613-18.827-4.62-4.195-12.2-6.694-27.313.99L259.2 425.156c28.086-30.964 65.366-68.32 87.653-102.594 3.04-4.676 1.373-11.558-3.237-15.41-2.017-1.685-4.398-3.036-7.39-3.185zm-122.707 36.64 7.197 16.498c-28.058 12.24-57.48 12.936-85.8-.072l7.513-16.355c23.976 11.013 46.85 10.504 71.09-.07z" fill="#fff" fill-opacity="1"></path></g></svg>`;

const svg모음 = {
    더하기,
    배터리,
    배터리팩,
    아래방향,
    플라워,
    투띵크
};

const 클래스맵 = {
    7: "마법의팔레트3위",
    8: "마법의팔레트2위",
    9: "마법의팔레트1위"
};

function svg크기변환(svg객체, size = 14, 색상키 = null) {
    const isPercent = typeof size === "string" && size.includes("%");

    // 단일 svg 문자열일 경우
    if (typeof svg객체 === "string") {
        let svg = svg객체;

        const 기본검 = 색상맵["중검"];
        const 기본흰 = 색상키 ? 색상맵[색상키] : 색상맵["중흰"];

        svg = svg
            .replace(/fill="#000"/g, `fill="${기본검}"`)
            .replace(/fill="#fff"/g, `fill="${기본흰}"`);

        if (isPercent) {
            svg = svg
                .replace(/height:\s*\d+px;/, `height: ${size};`)
                .replace(/width:\s*\d+px;/, `width: ${size};`);
        } else {
            svg = svg
                .replace(/height:\s*\d+px;/, `height: ${size}px;`)
                .replace(/width:\s*\d+px;/, `width: ${size}px;`);
        }

        return svg;
    }

    // 기존 객체 처리 로직
    const 결과 = {};
    for (const key in svg객체) {
        let svg = svg객체[key];

        const 기본검 = 색상맵["중검"];
        const 기본흰 = 색상키 ? 색상맵[색상키] : 색상맵["중흰"];

        svg = svg
            .replace(/fill="#000"/g, `fill="${기본검}"`)
            .replace(/fill="#fff"/g, `fill="${기본흰}"`);

        if (isPercent) {
            svg = svg
                .replace(/height:\s*\d+px;/, `height: ${size};`)
                .replace(/width:\s*\d+px;/, `width: ${size};`);
        } else {
            svg = svg
                .replace(/height:\s*\d+px;/, `height: ${size}px;`)
                .replace(/width:\s*\d+px;/, `width: ${size}px;`);
        }

        결과[key] = svg;
    }

    return 결과;
}

const 작은아이콘 = svg크기변환(svg모음, 14);
const 큰아이콘 = svg크기변환(svg모음, 42);

//속성모음
const 스타일맵 = {
    양쪽: {
        justifyContent: "space-between",
        width: "100%"
    },
    왼쪽: {
        justifyContent: "flex-start",
        width: "100%",
        textAlign: "left",

    },
    오른쪽: {
        justifyContent: "flex-end",
        width: "100%",
        textAlign: "right",
    },
    세로: {
        flexDirection: "column"
    },
    가로꽉: {
        width: "100%",
    },
    플렉스일: {
        flex: `1`,
    },
    사백: {
        width: "400px"
    },
    삼육공: {
        width: "360px"
    },
    고정: {
        position: "fixed"
    },
    부모꽉: {
        position: "absolute",
        top: "0",
        left: "0",
        width: "100%",
        height: "100%",
    },
    화면꽉: {
        position: "fixed",
        top: "0",
        left: "0",
        width: "100vw",
        height: "100vh",
    },
    화면중앙: {
        position: "fixed",
        top: "30%",
        left: "50%",
        transform: "translate(-50%, -50%)",
        width: "330px",
    },
    테두리: {
        border: "1px solid #D4D4D4",
        borderRadius: "8px"
    },
    테두리오른쪽: {
        borderRight: "1px solid #D4D4D4",
        borderRadius: "0"
    },
    밑줄: {
        borderBottom: "1px solid #D4D4D4",
        borderRadius: "0px"
    },
    외부: {
        margin: "5px 5px",
    },
    내부: {
        padding: "5px 5px",
    },
    여백: {
        margin: "5px 5px",
        padding: "5px 5px",
    },
    작게: {
        fontSize: "12px",
    },
    아주작게: {
        fontSize: "7px",
    },
    크게: {
        fontSize: "16px",
    },
    숨기기: {
        display: "none"
    },
    보이기: {
        display: "flex"
    },
    버튼: {
        addClass: "버튼"
    },
    황금박스: {
        addClass: "황금박스"
    },
    네온박스: {
        addClass: "네온박스"
    },
    연하게: {
        fontWeight: "lighter",
    },
    진하게: {
        fontWeight: "bold"
    },
    선택: {
        border: `1px solid ${색상맵[`중파`]}`,
        borderRadius: "8px"
    },
};

//document.body
//객체생성함수
function 객체생성(추가, 이름, ...옵션들) {
    const 대상 = document.createElement("div");
    대상.id = 이름;

    대상.style.display = "flex";
    대상.style.justifyContent = "center";
    대상.style.alignItems = "center";
    대상.style.boxSizing = "border-box";
    대상.style.borderRadius = "8px";
    대상.style.backgroundColor = "#1F1F1F";   // 기본 배경 유지

    // 대상.addEventListener("pointerdown", e => e.stopPropagation());
    // 대상.addEventListener("click", e => e.stopPropagation());

    for (const 옵션 of 옵션들) {
        const 스타일세트 = 스타일맵[옵션];
        if (!스타일세트) continue;

        // addClass 처리
        if (스타일세트.addClass) {
            대상.classList.add(스타일세트.addClass);

            // ⭐ 버튼일 때는 inline 배경 제거 → hover 정상작동
            if (옵션 === "버튼") {
                대상.style.backgroundColor = "";
            }
        }

        // addClass 제외하고 스타일 적용
        for (const key in 스타일세트) {
            if (key === "addClass") continue;
            대상.style[key] = 스타일세트[key];
        }
    }

    추가.append(대상);
    return 대상;
}

//인풋객체생성함수
function 인풋객체생성(추가, 이름, ...옵션들) {
    const 대상 = document.createElement("input");
    대상.id = 이름;

    대상.style.display = "flex";
    대상.style.justifyContent = "center";
    대상.style.alignItems = "center";
    대상.style.boxSizing = "border-box";
    대상.style.borderRadius = "8px";
    // 대상.style.backgroundColor = "#1F1F1F";   // 기본 배경 유지

    대상.autocomplete = "off";
    대상.style.textAlign = "center";

    for (const 옵션 of 옵션들) {
        const 스타일세트 = 스타일맵[옵션];
        if (!스타일세트) continue;

        // addClass 처리
        if (스타일세트.addClass) {
            대상.classList.add(스타일세트.addClass);

            // ⭐ 버튼일 때는 inline 배경 제거 → hover 정상작동
            if (옵션 === "버튼") {
                대상.style.backgroundColor = "";
            }
        }

        // addClass 제외하고 스타일 적용
        for (const key in 스타일세트) {
            if (key === "addClass") continue;
            대상.style[key] = 스타일세트[key];
        }
    }

    추가.append(대상);
    return 대상;
}

객체생성(document.body, "화면차단기", "화면꽉", "숨기기");
화면차단기.style.zIndex = "99999";
화면차단기.style.opacity = "0.5";

//화면잠금함수
function 화면잠금(메시지) {
    화면차단기.style.display = "flex";

    if (메시지) {
        알림창표시(메시지);
    }
}

function 화면해제() {
    화면차단기.style.display = "none";

}

//팝업객체생성
객체생성(document.body, "팝업컨테이너", "테두리", "세로", "화면중앙", "여백", "숨기기");
팝업컨테이너.style.zIndex = "999999";
객체생성(팝업컨테이너, "팝업내용", "왼쪽", "여백", "가로꽉");
팝업내용.innerHTML = `팝업내용`;
객체생성(팝업컨테이너, "팝업확인취소컨테이너", "양쪽", "");
객체생성(팝업확인취소컨테이너, "팝업확인취소컨테이너왼쪽", "", "");
객체생성(팝업확인취소컨테이너, "팝업확인취소컨테이너오른쪽", "", "");
객체생성(팝업확인취소컨테이너오른쪽, "팝업취소", "버튼", "테두리", "여백");
팝업취소.innerHTML = `취소`;
객체생성(팝업확인취소컨테이너오른쪽, "팝업확인", "버튼", "테두리", "여백");
팝업확인.innerHTML = `확인`;

객체생성(document.body, "미니정보창컨테이너", "테두리", "세로", "화면중앙", "여백", "숨기기");
미니정보창컨테이너.style.zIndex = "9999";


//팝업사용함수
function 팝업사용(메시지) {
    try {
        return new Promise(resolve => {
            팝업내용.innerHTML = 메시지;
            팝업컨테이너.style.display = "flex";

            // 이전 이벤트 제거
            팝업취소.onclick = null;
            팝업확인.onclick = null;

            // 취소 버튼 → false
            팝업취소.onclick = () => {
                팝업컨테이너.style.display = "none";
                resolve(false);
            };

            // 확인 버튼 → true
            팝업확인.onclick = () => {
                팝업컨테이너.style.display = "none";
                resolve(true);
            };
        });

    } catch (error) {
        console.log(error);
    } finally {

    }
}

객체생성(document.body, "상단바", "고정", "가로꽉", "밑줄",);
상단바.style.top = "0";
상단바.style.left = "0";
상단바.style.height = "51px";

객체생성(상단바, "상단바박스", "양쪽", "사백", "", "");

객체생성(상단바박스, "게임이름", "외부", "", "");
게임이름.innerHTML = `아재가 만든 게임들입니다`;

객체생성(상단바박스, "가글메뉴들", "", "", "숨기기");
객체생성(가글메뉴들, "가글전투", "", "여백", "버튼");
가글전투.innerHTML = `전투`;
객체생성(가글메뉴들, "가글성장", "", "여백", "버튼");
가글성장.innerHTML = `성장`;
객체생성(가글메뉴들, "가글월드", "", "여백", "버튼");
가글월드.innerHTML = `월드`;
객체생성(가글메뉴들, "가글전당", "", "여백", "버튼");
가글전당.innerHTML = `전당`;
객체생성(가글메뉴들, "가글정보", "", "여백", "버튼");
가글정보.innerHTML = `정보`;

객체생성(document.body, "가글월드툴팁", "고정", "테두리", "세로", "숨기기",);
가글월드툴팁.style.zIndex = "9999";
객체생성(가글월드툴팁, "가글마신전", "버튼", "여백", "");
가글마신전.innerHTML = `마신전`;
객체생성(가글월드툴팁, "가글보스", "버튼", "여백", "");
가글보스.innerHTML = `보스`;

객체생성(document.body, "가글성장툴팁", "고정", "테두리", "세로", "숨기기",);
가글성장툴팁.style.zIndex = "9999";
객체생성(가글성장툴팁, "가글장비", "버튼", "여백", "");
가글장비.innerHTML = `장비`;
객체생성(가글성장툴팁, "가글유물", "버튼", "여백", "");
가글유물.innerHTML = `유물`;
객체생성(가글성장툴팁, "가글스킬", "버튼", "여백", "");
가글스킬.innerHTML = `스킬`;
객체생성(가글성장툴팁, "가글영혼", "버튼", "여백", "");
가글영혼.innerHTML = `영혼`;
객체생성(가글성장툴팁, "가글버프", "버튼", "여백", "");
가글버프.innerHTML = `버프`;
객체생성(가글성장툴팁, "가글상점", "버튼", "여백", "");
가글상점.innerHTML = `상점`;

객체생성(document.body, "가글정보툴팁", "고정", "테두리", "세로", "숨기기",);
가글정보툴팁.style.zIndex = "9999";
객체생성(가글정보툴팁, "가글계정삭제", "버튼", "여백", "");
가글계정삭제.innerHTML = `계정삭제`;
객체생성(가글정보툴팁, "가글로그아웃", "버튼", "여백", "");
가글로그아웃.innerHTML = `로그아웃`;
객체생성(가글정보툴팁, "가글패치노트", "버튼", "여백", "");
가글패치노트.innerHTML = `패치노트`;
객체생성(가글정보툴팁, "가글일어난일", "버튼", "여백", "");
가글일어난일.innerHTML = `일어난일`;
객체생성(가글정보툴팁, "가글커뮤니티", "버튼", "여백", "");
가글커뮤니티.innerHTML = `커뮤니티`;
객체생성(가글정보툴팁, "가글메뉴얼", "버튼", "여백", "");
가글메뉴얼.innerHTML = `메뉴얼`;
객체생성(가글정보툴팁, "가글우편함", "버튼", "여백", "");
가글우편함.innerHTML = `우편함`;
객체생성(가글정보툴팁, "가글설정", "버튼", "여백", "");
가글설정.innerHTML = `설정`;
객체생성(가글정보툴팁, "가글광장", "버튼", "여백", "");
가글광장.innerHTML = `광장`;
객체생성(가글정보툴팁, "가글주인장", "버튼", "여백", "숨기기");
가글주인장.innerHTML = `주인장`;

객체생성(상단바박스, "삼국메뉴들", "", "", "숨기기");
객체생성(삼국메뉴들, "삼국전투", "", "여백", "버튼");
삼국전투.innerHTML = `전투`;
객체생성(삼국메뉴들, "삼국성장", "", "여백", "버튼");
삼국성장.innerHTML = `성장`;
객체생성(삼국메뉴들, "삼국월드", "", "여백", "버튼");
삼국월드.innerHTML = `월드`;
객체생성(삼국메뉴들, "삼국정보", "", "여백", "버튼");
삼국정보.innerHTML = `정보`;

객체생성(document.body, "가짜상단바", "", "가로꽉", "밑줄",);
가짜상단바.innerHTML = "　";
가짜상단바.style.height = "51px";

//변수선언
window.알림창타이머 = null;
window.네온타이머 = null;
window.황금타이머 = null;
window.유저 = null;
window.서브 = null;
window.자동플래그 = 0;

객체생성(document.body, "알림창", "여백", "", "");
알림창.style.color = 색상맵["중노"];

//알림창표시함수
function 알림창표시(메시지) {
    // 이전 타이머 제거
    if (알림창타이머) {
        clearTimeout(알림창타이머);
        알림창타이머 = null;
    }

    // 메시지 표시
    알림창.innerHTML = 메시지;
    알림창.style.color = 색상맵["중노"];

    // 3초 후 공백으로 변경
    알림창타이머 = setTimeout(() => {
        알림창.innerHTML = "　";
        알림창타이머 = null;
    }, 3000);
}

객체생성(document.body, "네온박스", "", "", "네온박스", "", "숨기기");
네온박스.style.zIndex = "999999";

//네온표시함수
function 네온표시(메시지) {
    // 이전 타이머 제거
    if (네온타이머) {
        clearTimeout(네온타이머);
        네온타이머 = null;
        네온박스.style.display = `none`;
    }

    // 메시지 표시
    네온박스.innerHTML = 메시지;
    네온박스.style.display = `flex`;

    // 3초 후 공백으로 변경
    네온타이머 = setTimeout(() => {
        네온박스.innerHTML = "";
        네온박스.style.display = `none`;
        네온타이머 = null;
    }, 3000);
}

객체생성(document.body, "황금박스", "", "", "황금박스", "", "숨기기");
황금박스.style.zIndex = "999999";

//황금표시함수
function 황금표시(메시지) {
    // 이전 타이머 제거
    if (황금타이머) {
        clearTimeout(황금타이머);
        황금타이머 = null;
        황금박스.style.display = `none`;
    }

    // 메시지 표시
    황금박스.innerHTML = 메시지;
    황금박스.style.display = `flex`;

    // 3초 후 공백으로 변경
    황금타이머 = setTimeout(() => {
        황금박스.innerHTML = "";
        황금박스.style.display = `none`;
        황금타이머 = null;
    }, 3000);
}

알림창표시(`　`);

객체생성(document.body, "게임선택컨테이너", "사백", "테두리", "세로", "내부");

객체생성(게임선택컨테이너, "게임선택설명", "가로꽉", "밑줄", "여백");
게임선택설명.innerHTML = `원하는 게임을 선택하세요`;

객체생성(게임선택컨테이너, "가글", "버튼", "테두리", "여백");
가글.innerHTML = `新가글`;

객체생성(게임선택컨테이너, "삼국맨", "버튼", "테두리", "여백");
삼국맨.innerHTML = `삼국맨`;

const 게임 = localStorage.getItem("lastGame");
const 저장유저 = localStorage.getItem("lastUser");

if (게임 && 저장유저) {
    const { 아이디, 비번 } = JSON.parse(저장유저);

    if (게임 === "가글") {

        setTimeout(() => {
            가글.click();   // 클릭해야 내부 함수들이 생성됨
        }, 50);

        setTimeout(() => {
            window.가글자동로그인 = 1;
            가글아이디입력.value = 아이디;
            가글비번입력.value = 비번;
            가글로그인.click();
        }, 100);
    } else if (게임 === "삼국맨") {

        setTimeout(() => {
            삼국맨.click();   // 클릭해야 내부 함수들이 생성됨
        }, 50);

        setTimeout(() => {
            아이디입력.value = 아이디;
            비번입력.value = 비번;
            로그인.click();
        }, 100);
    }

}


객체생성(document.body, "가글로그인컨테이너", "사백", "테두리", "세로", "내부", "숨기기");

//가글로그인화면함수
async function 가글로그인화면() {
    try {
        화면잠금(`gagl에 오신걸 환영합니다`);
        가글화면전환(가글로그인컨테이너);

        가글로그인컨테이너.innerHTML = ``;


        객체생성(가글로그인컨테이너, "가글로그인설명", "가로꽉", "밑줄", "여백", "세로");
        가글로그인설명.innerHTML = `아이디는 한글만 가능합니다`;

        인풋객체생성(가글로그인컨테이너, "가글아이디입력", "", "", "여백");
        가글아이디입력.type = "text";
        가글아이디입력.placeholder = "아이디 입력";

        인풋객체생성(가글로그인컨테이너, "가글비번입력", "", "", "여백");
        가글비번입력.type = "password";
        가글비번입력.placeholder = "비번 입력";

        객체생성(가글로그인컨테이너, "가글회원가입", "버튼", "테두리", "여백");
        가글회원가입.innerHTML = `회원가입`;
        객체생성(가글로그인컨테이너, "가글로그인", "버튼", "테두리", "여백");
        가글로그인.innerHTML = `로그인`;

        가글아이디입력.addEventListener("input", () => {
            if (가글아이디입력.value !==
                가글아이디입력.value
                    .replace(/[^ㄱ-ㅎㅏ-ㅣ가-힣]/g, "")
                    .slice(0, 6)
            ) {
                알림창표시("아이디는 한글 6글자까지 가능합니다");
                가글아이디입력.value =
                    가글아이디입력.value
                        .replace(/[^ㄱ-ㅎㅏ-ㅣ가-힣]/g, "")
                        .slice(0, 6);
            }
        });

        가글비번입력.addEventListener("keydown", async (e) => {
            // 엔터키
            if (e.key === "Enter") {
                가글로그인.click();
            }

            // 스페이스바 (원하는 경우만)
            if (e.key === " ") {    // 또는 e.code === "Space"
                e.preventDefault(); // 스페이스 입력 막음
                가글로그인.click();
            }
        });

        //가글회원가입함수
        가글회원가입.onclick = async () => {
            try {
                화면잠금(`회원가입중입니다`);

                const id값 = 가글아이디입력.value.trim();
                const pw값 = 가글비번입력.value.trim();

                if (!id값 || !pw값) {
                    알림창표시("아이디/비밀번호를 입력해주세요");
                    return;
                }

                // 한글만 허용
                if (!/^[ㄱ-ㅎㅏ-ㅣ가-힣]+$/.test(id값)) {
                    알림창표시("아이디는 한글만 가능합니다");
                    return;
                }

                const 응답 = await fetch("/rkrmf", {
                    method: "POST",
                    headers: { "Content-Type": "application/json" },
                    body: JSON.stringify({
                        액션: "가글회원가입",
                        액션데이터: { 아이디: id값, 비번: pw값, 서버: 1 }
                    })
                });

                const 결과 = await 응답.json();

                if (결과.성공) {
                    알림창표시("가글회원가입 완료!");


                } else {
                    알림창표시(결과.오류);
                }


            } catch (error) {
                console.log(error);
            } finally {
                화면해제();
            }
        };

        //가글로그인함수
        가글로그인.onclick = async () => {
            try {

                // const now = new Date();

                // const 조건 =
                //     now.getMonth() === 11 &&
                //     now.getDate() === 29 &&
                //     now.getHours() === 10 &&
                //     now.getMinutes() === 30;

                // if (!조건) {
                //     알림창표시(`12월 29일 월요일 오전 10시 30분에 오픈됩니다`);
                //     // return;
                // }


                화면잠금(`로그인중입니다`);

                if (window.가글자동로그인) {
                    알림창표시(`자동로그인중입니다`);
                }


                const id값 = 가글아이디입력.value.trim();
                const pw값 = 가글비번입력.value.trim();

                if (!id값 || !pw값) {
                    알림창표시("아이디/비밀번호를 입력해주세요");
                    return;
                }

                // 한글만 허용
                if (!/^[ㄱ-ㅎㅏ-ㅣ가-힣]+$/.test(id값)) {
                    알림창표시("아이디는 한글만 가능합니다");
                    return;
                }

                const 응답 = await fetch("/rkrmf", {
                    method: "POST",
                    headers: { "Content-Type": "application/json" },
                    body: JSON.stringify({
                        액션: "가글로그인",
                        액션데이터: { 아이디: id값, 비번: pw값, 서버: 1 }
                    })
                });

                const 결과 = await 응답.json();

                if (결과.성공) {
                    알림창표시("로그인되었습니다");

                    if (결과.업뎃했으니새고) {
                        location.reload();
                    }
                    유저 = 결과.가글;
                    localStorage.setItem("lastGame", "가글");
                    localStorage.setItem("lastUser", JSON.stringify({ 아이디: id값, 비번: pw값 }));

                    화면목록[유저.스탯.화면번호]?.실행() || 화면목록[0].실행();

                    가글메뉴들.style.display = `flex`;

                    function 가글메뉴툴팁설정(버튼, 툴팁) {

                        // 보여주기
                        function show() {
                            툴팁.style.display = "flex";

                            const rect = 버튼.getBoundingClientRect();
                            const tip = 툴팁.getBoundingClientRect();

                            툴팁.style.left = (rect.right - tip.width) + "px";
                            툴팁.style.top = (rect.bottom - 0) + "px";
                        }

                        // 숨기기
                        function hide() {
                            툴팁.style.display = "none";
                        }

                        // 버튼 위로 가면 열림
                        버튼.addEventListener("mouseenter", () => {
                            if (window.가글터치모드) return;
                            show();
                        });

                        // 버튼에서 나갈 때
                        버튼.addEventListener("mouseleave", async (e) => {
                            if (window.가글터치모드) return;
                            if (!툴팁.contains(e.relatedTarget)) hide();
                        });

                        // 툴팁에서 나갈 때
                        툴팁.addEventListener("mouseleave", async (e) => {
                            if (window.가글터치모드) return;
                            if (!버튼.contains(e.relatedTarget)) hide();
                        });
                    }

                    가글메뉴툴팁설정(가글정보, 가글정보툴팁);
                    가글메뉴툴팁설정(가글성장, 가글성장툴팁);
                    가글메뉴툴팁설정(가글월드, 가글월드툴팁);

                    window.마신방어1위 = 결과.마신방어1위;
                    window.마신방어2위 = 결과.마신방어2위;
                    window.마신방어3위 = 결과.마신방어3위;

                    게임이름.innerHTML = 유저.스탯.닉네임;
                    if (마신방어1위?.스탯.닉네임 === 유저.스탯.닉네임) {
                        게임이름.className = "마법의팔레트1위";
                    } else if (마신방어2위?.스탯.닉네임 === 유저.스탯.닉네임) {
                        게임이름.className = "마법의팔레트2위";
                    } else if (마신방어3위?.스탯.닉네임 === 유저.스탯.닉네임) {
                        게임이름.className = "마법의팔레트3위";
                    }

                    if (유저.스탯.주인장) {
                        가글주인장.style.display = `flex`;
                    }

                    서브 = 결과.가글서브;

                    // if (서브.스탯.) {
                    //     // setInterval(() => {
                    //     //     황금표시(`현재 버그발생`);
                    //     // }, 30000);
                    // }

                } else {
                    알림창표시(결과.오류);

                }

            } catch (error) {
                console.log(error);
            } finally {
                화면해제();
                if (서브) {
                    if (서브.스탯.차단) {
                        화면차단기.style.display = `flex`;
                        화면차단기.style.opacity = "1";
                        화면차단기.innerHTML = `차단되었습니다`;
                    } else if (서브.스탯.점검) {
                        화면차단기.style.display = `flex`;
                        화면차단기.style.opacity = "1";
                        화면차단기.innerHTML = `점검중 >.<`;
                    }

                }

                if (!유저) {
                    localStorage.removeItem("lastGame");
                    localStorage.removeItem("lastUser");

                }
            }
        };

    } catch (error) {
        console.log(error);

    } finally {
        화면해제();

    }
}





//가글함수
가글.onclick = async () => {
    try {
        가글로그인화면();
        게임이름.innerHTML = `gagl`;
    } catch (error) {
        console.log(error);
    } finally {
    }
};

//가글로그아웃함수
가글로그아웃.onclick = async (e) => {
    e.stopPropagation();
    try {
        화면잠금(`비밀번호 분실 시 복구가 불가능합니다`);

        const 확인 = await 팝업사용(`로그아웃 하시겠습니까?`);
        if (!확인) return;

        localStorage.removeItem("lastGame");
        localStorage.removeItem("lastUser");
        location.reload();

    } catch (error) {
        console.log(error);
    } finally {
        화면해제();
    }
};

//가글계정삭제함수
가글계정삭제.onclick = async (e) => {
    e.stopPropagation();
    try {
        화면잠금(`다시 만나길 고대하겠습니다`);

        const 확인 = await 팝업사용(`삭제된 계정은 복구가 불가능합니다<br>그래도 삭제하시겠습니까?`);
        if (!확인) return;

        if (window.가글자동가글계정삭제) {
            알림창표시(`자동가글계정삭제중입니다`);
        }

        const 응답 = await fetch("/rkrmf", {
            method: "POST",
            headers: { "Content-Type": "application/json" },
            body: JSON.stringify({
                액션: "계정삭제",
                액션데이터: { 유저id: 유저.id }
            })
        });

        const 결과 = await 응답.json();

        if (결과.성공) {
            localStorage.removeItem("lastGame");
            localStorage.removeItem("lastUser");
            location.reload();
        } else {
            알림창표시(결과.오류);
        }

    } catch (error) {
        console.log(error);
    } finally {
        화면해제();
    }
};






객체생성(document.body, "가글패치노트컨테이너", "사백", "테두리", "세로", "내부", "숨기기");

//가글패치노트화면함수
async function 가글패치노트화면() {
    try {
        화면잠금(`패치노트 확인을 생활화하세요`);
        가글화면전환(가글패치노트컨테이너);

        가글패치노트컨테이너.innerHTML = ``;

        객체생성(가글패치노트컨테이너, "가글패치노트설명", "가로꽉", "밑줄", "여백");

        //버전표시
        가글패치노트설명.innerHTML = `v0.2.6`;

        //패치노트작성
        객체생성(가글패치노트컨테이너, "가글패치노트들", "", "", "여백");
        가글패치노트들.innerHTML =
            `
        <br>
        25.12.31<br>
        버프에 10번스킬. 도약이 포함되었습니다<br>
        월드 - "보스"가 구현되었습니다<br>

        <br>
        25.12.30<br>
        성장 - 버프 화면이 구현되었습니다<br>
        성장 - 상점 화면이 구현되었습니다<br>
        10번째 스킬. 도약이 구현되었습니다<br>
        도약은 "전투"에서의 스태미너 소모량을 증가시킵니다<br>
        실제로 소모되는 스태미너만큼<br>
        n회 전투가 진행되지만, 화면에 출력되는 로그는<br>
        n회 중 첫번째 로그만이 표시됩니다<br>

        <br>
        25.12.29<br>
        서버 재오픈<br>
        전투화면 유저 스탯박스에 속력 표시가 추가되었습니다<br>
        유물의 보너스 스탯 증가량이 0.1시작에서 ➡ 0.01시작으로<br>
        변경되었습니다<br>
        미니정보창에 n일차가 추가되었습니다<br>
        접속일차는 버프화면 계산식에 사용됩니다<br>
        회원가입 아이디의 최대글자가 6글자로 제한되었습니다<br>

        <br>
        25.12.27<br>
        장비 승급 필요숙련도 2배수 ➡ 3배수로 변경<br>
        재앙맵 등장확률 3% ➡ 1%로 변경<br>
        유물 투자 ➡ 랜덤드랍으로 변경<br>
        유물 등급당 증가수치 +0.n 등차 ➡ ×3으로 변경<br>

        <br>
        25.12.26<br>
        오후 9시 12분 경 주인장 실수로..<br>
        ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ데이터 소멸ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ<br>
                       
        <br>
        25.12.26<br>
        스킬. 과열의 조건이 스킬레벨×5 ➡ 스킬레벨×2 로<br>
        변경되었습니다<br>
        전당화면에 미니정보창이 구현되었습니다<br>
        미니정보창은 화면 어디를 터치하더라도 닫힙니다<br>
        미니정보창에 전적이 추가되었습니다<br>
        마신전 마신의 장비에도 등급색상이 적용됩니다<br>
        마신방어 순위에 따른 마법의팔레트 효과가<br>
        타이틀 닉네임과 광장에서도 적용됩니다<br>
                       
        <br>
        25.12.24<br>
        패배해도 멈추지 않는 무자동 버튼이 구현되었습니다<br>
                       
        <br>
        25.12.23<br>
        영혼드랍박스와 유물드랍박스가 겹쳤을 때 하나가<br>
        사라지지 않던 현상을 수정했습니다<br>
        성장 - 영혼 탭에서 이제 획득한 영혼만 표시됩니다<br>
        장비 중 장신구의 체력 리롤값 계산식이 의도와 달라<br>
        수정되었습니다<br>
                
        <br>
        25.12.22<br>
        우편함의 우편물 설명과 메모의 가독성을 올려봤습니다<br>
        장비 승급과 리롤 비용의 밸런스를 고민중입니다<br>
        우선 비용을 조정해봤습니다<br>
        층마다 악마들의 영혼을 수집할 수 있습니다(드랍률 1%)<br>
        각 층에서 수집된 영혼들은 다음층 몬스터들의 스탯을<br>
        감소시킵니다<br>
        정확한 수치는 성장 - 영혼 탭에서 확인 가능합니다<br>
                
        <br>
        25.12.21<br>
        악마성 층별로 분리되어있던 전당이 통합되었습니다<br>
        마신전 방어 횟수에 따른 1 2 3위의 마법의팔레트가<br>
        전당화면 닉네임에 적용됩니다<br>
        닉좀 길게 만드시면 더 예쁜 팔레트를 보실 수 있습니다<br>
                
        <br>
        25.12.20<br>
        마신전 치킨의 시대가 종료되었습니다<br>
        이제 새로운 마신들이 정상적으로 등극될 수 있습니다<br>
        우편함 우편물 수령 시 스태미너 회복에 수량 적용이 안되던<br>
        문제가 해결되었습니다<br>
        장비 승급비용이 투자순서 ➡ 부위별 등급으로 변경되었습니다<br>
                
        <br>
        25.12.19<br>
        서버오픈<br>
        유물을 보유하지 않은 상태에서도 투자한 유물의<br>
        초기화가 가능합니다<br>
        무분별한 방어와 숭배 상승을 막기위해<br>
        도전과 숭배를 9레벨로 제한합니다<br>
        마신에게 도전 시 자동으로 체력이 회복됩니다<br>
        현재레벨에 현재경험치 표시를 추가했습니다<br>
        일어난일에 일반몬스터 11번, 33번, 66번 로그를 추가했습니다<br>
        
        <br>
        25.12.18<br>
        정보 - 설정- 장비이름변환 구현<br>
        월드 - 마신전 구현 완료<br>
        
        <br>
        25.12.17<br>
        모든 스킬 전투에 적용 완료<br>
        
        <br>
        25.12.16<br>
        성장 - 유물화면 업데이트<br>
        
        <br>
        25.12.15<br>
        전당 업데이트<br>
        정보 - 일어난일 업데이트<br>
        
        <br>
        25.12.14<br>
        전투로그 업데이트<br>
        성장 - 장비화면 업데이트<br>
        
        <br>
        25.12.11<br>
        전투화면 업데이트<br>
        
        <br>
        25.12.10<br>
        코드리셋. 처음부터 다시시작<br>
        
        <br>
        25.12.07<br>
        개발시작<br>
        <br>
        `;

    } catch (error) {
        console.log(error);
    } finally {
        화면해제();
    }
}

가글패치노트.onclick = async () => {
    try {
        if (가글패치노트컨테이너.style.display === "none") {
            가글패치노트화면();
        }
    } catch (error) {
        console.log(error);
    } finally {
        화면해제();
    }
};

객체생성(document.body, "가글전투컨테이너", "사백", "", "세로", "숨기기");

//가글전투화면함수
async function 가글전투화면() {
    try {
        화면잠금();
        가글화면전환(가글전투컨테이너);

        가글전투컨테이너.innerHTML = ``;

        객체생성(가글전투컨테이너, "가글전투설명", "가로꽉", "테두리", "여백");
        가글전투설명.innerHTML = `스태미너는 시간당 120이 회복됩니다<br>
        스태미너 회복은 로그인 기준이라 정시 이후 새로고침을<br>
        한번 해주셔야 스태미너가 정상적으로 회복됩니다<br>
        `;

        객체생성(가글전투컨테이너, "가글스태컨테이너", "가로꽉", "테두리", "여백", "세로");
        객체생성(가글스태컨테이너, "가글스태아이콘숫자", "양쪽", "", "", "");
        객체생성(가글스태아이콘숫자, "가글스태아이콘", "", "", "", "");
        가글스태아이콘.innerHTML = 작은아이콘.배터리팩;
        객체생성(가글스태아이콘숫자, "가글스태숫자", "", "", "", "");
        가글스태숫자.innerHTML = `${유저.스탯.현재스태미너}/${유저.스탯.최대스태미너}`;
        객체생성(가글스태컨테이너, "가글스태미너", "왼쪽", "", "", "");
        객체생성(가글스태미너, "현재스태미너", "", "", "", "");
        현재스태미너.style.backgroundColor = 색상맵["진노"];
        현재스태미너.style.width = `${100 * 유저.스탯.현재스태미너 / 유저.스탯.최대스태미너}%`;
        현재스태미너.style.height = `6px`;

        객체생성(가글전투컨테이너, "층조절", "가로꽉", "테두리", "여백", "");
        객체생성(층조절, "아래층으로", "", "버튼", "여백", "");
        아래층으로.innerHTML = `아래층으로`;
        객체생성(층조절, "현재층", "", "", "여백", "");
        현재층.innerHTML = 유저.스탯.현재층 + `층`;
        객체생성(층조절, "위층으로", "", "버튼", "여백", "");
        위층으로.innerHTML = `위층으로`;

        아래층으로.onclick = async () => {
            try {
                if (유저.스탯.현재층 < 2) {
                    알림창표시(`더이상 내려갈 수 없습니다`);
                    return;
                }
                유저.스탯.현재층--;
                현재층.innerHTML = 유저.스탯.현재층 + `층`;

            } catch (error) {
                console.log(error);
            } finally {
                화면해제();
            }
        };

        위층으로.onclick = async () => {
            try {
                if (유저.스탯.현재층 > 유저.스탯.최고층) {
                    알림창표시(`${유저.스탯.현재층}층을 먼저 돌파하세요`);
                    return;
                }
                유저.스탯.현재층++;
                현재층.innerHTML = 유저.스탯.현재층 + `층`;

            } catch (error) {
                console.log(error);
            } finally {
                화면해제();
            }
        };

        객체생성(가글전투컨테이너, "레벨골드숙련도", "양쪽", "", "여백", "테두리");

        객체생성(레벨골드숙련도, "레벨경험치획득경험치", "가로꽉", "세로", "여백", "");
        레벨경험치획득경험치.style.backgroundColor = 색상맵[`연검`];






        객체생성(레벨경험치획득경험치, "레벨과경험치", "", "가로꽉", "여백", "");
        레벨과경험치.style.backgroundColor = 색상맵[`연검`];


        객체생성(레벨과경험치, "현재레벨", "", "", "", "");
        현재레벨.innerHTML = `레벨 ${유저.스탯.레벨}`;
        현재레벨.style.backgroundColor = 색상맵[`연검`];
        현재레벨.style.color = 색상맵[`중초`];
        현재레벨.style.fontWeight = `bold`;

        const 필요경험치 = 유저.스탯.레벨 * (유저.스탯.레벨 * 0.8) * 1000;
        const 퍼센트 = Math.floor((유저.스탯.현재경험치 / 필요경험치) * 100);

        객체생성(레벨과경험치, "경험치퍼센트", "", "", "", "작게");
        경험치퍼센트.innerHTML = `(${퍼센트}%)`;
        경험치퍼센트.style.backgroundColor = 색상맵[`연검`];

        // 객체생성(레벨경험치획득경험치, "현재레벨", "", "가로꽉", "여백", "");
        // 현재레벨.innerHTML = `레벨 ${유저.스탯.레벨}`;
        // 현재레벨.style.backgroundColor = 색상맵[`연검`];
        // 현재레벨.style.color = 색상맵[`중초`];
        // 현재레벨.style.fontWeight = `bold`;



        객체생성(레벨경험치획득경험치, "현재경험치", "", "진하게", "여백", "크게");
        현재경험치.innerHTML = 숫자한글(유저.스탯.현재경험치);
        현재경험치.style.backgroundColor = 색상맵[`연검`];
        객체생성(레벨경험치획득경험치, "획득경험치", "", "", "여백", "작게");
        획득경험치.innerHTML = 0;
        획득경험치.style.backgroundColor = 색상맵[`연검`];

        객체생성(레벨골드숙련도, "골드현재골드획득골드", "가로꽉", "세로", "여백", "");
        골드현재골드획득골드.style.backgroundColor = 색상맵[`연검`];

        객체생성(골드현재골드획득골드, "골드타이틀", "", "", "여백", "");
        골드타이틀.innerHTML = `골드`
        골드타이틀.style.backgroundColor = 색상맵[`연검`];
        골드타이틀.style.fontWeight = `bold`;
        객체생성(골드현재골드획득골드, "현재골드", "", "진하게", "여백", "크게");
        현재골드.innerHTML = 숫자한글(유저.스탯.현재골드);
        현재골드.style.backgroundColor = 색상맵[`연검`];
        현재골드.style.color = 색상맵[`진노`];
        객체생성(골드현재골드획득골드, "획득골드", "", "", "여백", "작게");
        획득골드.innerHTML = 0;
        획득골드.style.backgroundColor = 색상맵[`연검`];

        객체생성(레벨골드숙련도, "숙련도현재숙련도획득숙련도", "가로꽉", "세로", "여백", "");
        숙련도현재숙련도획득숙련도.style.backgroundColor = 색상맵[`연검`];

        객체생성(숙련도현재숙련도획득숙련도, "숙련도타이틀", "", "", "여백", "");
        숙련도타이틀.innerHTML = `숙련도`
        숙련도타이틀.style.backgroundColor = 색상맵[`연검`];
        숙련도타이틀.style.fontWeight = `bold`;
        객체생성(숙련도현재숙련도획득숙련도, "현재숙련도", "", "진하게", "여백", "크게");
        현재숙련도.innerHTML = 숫자한글(유저.스탯.현재숙련도);
        현재숙련도.style.backgroundColor = 색상맵[`연검`];
        현재숙련도.style.color = 색상맵[`진파`];
        객체생성(숙련도현재숙련도획득숙련도, "획득숙련도", "", "", "여백", "작게");
        획득숙련도.innerHTML = 0;
        획득숙련도.style.backgroundColor = 색상맵[`연검`];

        // 레벨경험치획득경험치.style.flex = `1`;
        // 골드현재골드획득골드.style.flex = `1`;
        // 숙련도현재숙련도획득숙련도.style.flex = `1`;

        객체생성(가글전투컨테이너, "반자동악마성풀자동", "테두리", "가로꽉", "여백", "세로");
        반자동악마성풀자동.style.border = 유저.스탯.히든 ? `1px solid ${색상맵[`진남`]}` : `1px solid ${색상맵[`중흰`]}`;
        객체생성(반자동악마성풀자동, "반자동풀자동", "양쪽", "", "", "");
        객체생성(반자동풀자동, "반자동", "버튼", "", "여백", "");
        반자동.innerHTML = `반자동`;

        // 객체생성(반자동풀자동, "여기클릭", "", "", "여백", "");
        // 여기클릭.innerHTML = svg크기변환(아래방향, 14, "중빨");
        // const svg = 여기클릭.querySelector("svg");
        // const paths = svg.querySelectorAll("path");
        // const arrow = paths[1];
        // const wrapper = document.createElementNS("http://www.w3.org/2000/svg", "g");
        // wrapper.setAttribute("transform-origin", "center");
        // wrapper.setAttribute("transform-box", "fill-box");
        // const animate = document.createElementNS("http://www.w3.org/2000/svg", "animateTransform");
        // animate.setAttribute("attributeName", "transform");
        // animate.setAttribute("type", "scale");
        // animate.setAttribute("values", "1 1; 1 0.8; 1 1.2; 1 1");
        // animate.setAttribute("dur", "1s");
        // animate.setAttribute("repeatCount", "indefinite");
        // arrow.replaceWith(wrapper);
        // wrapper.appendChild(arrow);
        // wrapper.appendChild(animate);

        객체생성(반자동풀자동, "풀자동", "버튼", "", "여백", "");
        풀자동.innerHTML = `풀자동`;


        객체생성(반자동풀자동, "무자동", "버튼", "", "여백", "");
        무자동.innerHTML = `무자동`;



        객체생성(반자동악마성풀자동, "악마성", "테두리", "버튼", "여백", "");
        악마성.innerHTML = 유저.스탯.히든 ? `재앙` : `악마성`;
        악마성.style.backgroundColor = 유저.스탯.히든 ? `${색상맵[`진남`]}` : `${색상맵[`중검`]}`;
        악마성.style.color = 유저.스탯.히든 ? `${색상맵[`중흰`]}` : `${색상맵[`중흰`]}`;

        if (자동플래그 === 1) {
            if (유저.스탯.히든) {
                자동플래그 = 0;
            }
        }

        객체생성(가글전투컨테이너, "유저정보", "테두리", "가로꽉", "여백", "양쪽");
        유저정보.style.border = `1px solid ${색상맵[`진파`]}`;

        객체생성(유저정보, "유저닉네임", "", "가로꽉", "왼쪽", "");
        객체생성(유저닉네임, "유저닉넴", "", "", "왼쪽", "여백");
        유저닉넴.innerHTML = 유저.스탯.닉네임;

        객체생성(유저정보, "유저전투력", "", "가로꽉", "", "여백");
        객체생성(유저전투력, "유저전투력표시", "", "", "", "여백");
        유저전투력표시.innerHTML = `전투력 ` + 숫자한글(유저.스탯.전투력);

        객체생성(유저정보, "유저공방체", "", "가로꽉", "오른쪽", "세로", "");
        객체생성(유저공방체, "유저공", "", "", "", "", "오른쪽");
        객체생성(유저공방체, "유저방", "", "", "", "", "오른쪽");
        객체생성(유저공방체, "유저체", "", "", "", "", "오른쪽");
        객체생성(유저공방체, "유저속", "", "", "", "", "오른쪽");
        유저공.innerHTML = `공격력 ` + 숫자한글(유저.스탯.최종공격력);
        유저방.innerHTML = `방어력 ` + 숫자한글(유저.스탯.최종방어력);
        유저체.innerHTML = `체력 ${숫자한글(유저.스탯.현재체력)}/${숫자한글(유저.스탯.최종체력)}`;
        유저속.innerHTML = `속력 ${숫자한글(유저.스탯.최종속력)}`;

        악마성.onclick = async () => {
            try {
                화면잠금();

                if (유저.스탯.현재스태미너 < 11) {
                    알림창표시(`남은 10 스태미너로 설정변경이나 마신을 숭배해주세요`);
                    자동플래그 = 0;
                    return;
                }

                const 응답 = await fetch("/rkrmf", {
                    method: "POST",
                    headers: { "Content-Type": "application/json" },
                    body: JSON.stringify({
                        액션: "가글전투",
                        액션데이터: { 유저id: 유저.id, 현재층: 유저.스탯.현재층 }
                    })
                });

                const 결과 = await 응답.json();

                if (결과.성공) {
                    유저 = 결과.가글;

                    가글전투화면();

                    객체생성(가글전투컨테이너, "몬스터정보", "테두리", "", "여백", "양쪽");
                    몬스터정보.style.border = 결과.몬스터.스탯.히든 ? `1px solid ${색상맵[`진남`]}` : `1px solid ${색상맵[`중빨`]}`;

                    객체생성(몬스터정보, "몬스터닉네임", "", "가로꽉", "왼쪽", "");
                    객체생성(몬스터닉네임, "몬스터닉넴", "", "", "왼쪽", "여백");
                    몬스터닉넴.innerHTML = 결과.몬스터.스탯.히든 ? 히든몬스터[결과.몬스터.스탯.번호 - 1] : 일반몬스터[결과.몬스터.스탯.번호 - 1];

                    객체생성(몬스터정보, "몬스터전투력", "", "가로꽉", "", "여백");
                    객체생성(몬스터전투력, "몬스터전투력표시", "", "", "", "여백");
                    몬스터전투력표시.innerHTML = `전투력 ` + 숫자한글(결과.몬스터.스탯.전투력);

                    객체생성(몬스터정보, "몬스터공방체", "", "가로꽉", "오른쪽", "세로", "");
                    객체생성(몬스터공방체, "몬스터공", "", "", "", "", "오른쪽");
                    객체생성(몬스터공방체, "몬스터방", "", "", "", "", "오른쪽");
                    객체생성(몬스터공방체, "몬스터체", "", "", "", "", "오른쪽");
                    몬스터공.innerHTML = `공격력 ` + 숫자한글(결과.몬스터.스탯.최종공격력);
                    몬스터방.innerHTML = `방어력 ` + 숫자한글(결과.몬스터.스탯.최종방어력);
                    몬스터체.innerHTML = `체력 ${숫자한글(결과.몬스터.스탯.현재체력)}/${숫자한글(결과.몬스터.스탯.최종체력)}`;

                    if (결과.전투결과.승패) {
                        객체생성(반자동악마성풀자동, "승리", "", "진하게", "여백", "크게");
                        승리.innerHTML = `승리`;
                        승리.style.color = 색상맵["중초"];

                        객체생성(반자동악마성풀자동, "획득", "", "작게", "여백", "");
                        획득.innerHTML = `${숫자로만(유저.스탯.획득경험치)}(${(
                            유저.스탯.획득경험치 /
                            (유저.스탯.레벨 * (유저.스탯.레벨 * 0.8) * 1000) * 100
                        ).toFixed(2)}%) EXP, ${숫자로만(유저.스탯.획득골드)} Gold, ${숫자로만(유저.스탯.획득숙련도)} 숙련도 획득`;
                        획득.style.color = 색상맵["중초"];

                        획득경험치.innerHTML = `+` + 숫자로만(유저.스탯.획득경험치);
                        획득골드.innerHTML = `+` + 숫자로만(유저.스탯.획득골드);
                        획득골드.style.color = 색상맵[`중초`];
                        획득숙련도.innerHTML = `+` + 숫자로만(유저.스탯.획득숙련도);
                        획득숙련도.style.color = 색상맵[`중초`];

                        if (결과.몬스터.스탯.히든) {
                            네온표시(`${등급[결과.몬스터.스탯.번호].이름} 유물 ${유물모음[결과.몬스터.스탯.번호].이름}(을)를 드랍!`);
                        }

                        if (결과.영혼) {
                            황금표시(`${결과.영혼}층 [${등급[결과.영혼].이름}] 악마의 영혼 흡수!`);
                        }

                        if (자동플래그) {
                            악마성.onclick();
                        };


                    } else {
                        객체생성(반자동악마성풀자동, "패배", "", "진하게", "여백", "크게");
                        패배.innerHTML = `패배`;
                        패배.style.color = 색상맵["중빨"];

                        if (자동플래그 === 3) {
                            악마성.onclick();
                        } else {
                            자동플래그 = 0;
                        }

                    }

                    for (const i in 결과.전투결과.전투로그) {
                        객체생성(가글전투컨테이너, `${i}턴로그`, "세로", "사백", "테두리", "여백");
                        객체생성(window[`${i}턴로그`], `${i}턴`, "", "가로꽉", "밑줄", "여백");
                        window[`${i}턴`].innerHTML = `${i} Turn`;

                        for (const j in 결과.전투결과.전투로그[i]) {
                            if (결과.전투결과.전투로그[i][j].주체) {
                                객체생성(window[`${i}턴로그`], `${i}${j}로그`, "", "가로꽉", "왼쪽", "여백");
                                window[`${i}${j}로그`].style.color = 색상맵[`중파`];


                                const 로그 = 결과.전투결과.전투로그[i][j];

                                let 접두어 = "";

                                if (로그.스킬.includes(1)) 접두어 += "[치명]";
                                if (로그.스킬.includes(2)) 접두어 += "[기절]";
                                if (로그.스킬.includes(3)) 접두어 += "[반격]";
                                if (로그.스킬.includes(4)) 접두어 += "[회복]";
                                if (로그.스킬.includes(5)) 접두어 += "[과열]";
                                if (로그.스킬.includes(6)) 접두어 += "[분쇄]";
                                if (로그.스킬.includes(7)) 접두어 += "[처형]";
                                if (로그.스킬.includes(8)) 접두어 += "[조준]";
                                if (로그.스킬.includes(9)) 접두어 += "[쇠약]";

                                window[`${i}${j}로그`].innerHTML =
                                    `${접두어} ${로그.피해.toLocaleString()}`;


                            } else {
                                객체생성(window[`${i}턴로그`], `${i}${j}로그`, "", "가로꽉", "오른쪽", "여백");
                                window[`${i}${j}로그`].style.color = 색상맵[`중빨`];


                                const 로그 = 결과.전투결과.전투로그[i][j];

                                let 접두어 = "";

                                if (로그.스킬.includes(1)) 접두어 += "[치명]";
                                if (로그.스킬.includes(2)) 접두어 += "[기절]";
                                if (로그.스킬.includes(3)) 접두어 += "[반격]";
                                if (로그.스킬.includes(4)) 접두어 += "[회복]";
                                if (로그.스킬.includes(5)) 접두어 += "[과열]";
                                if (로그.스킬.includes(6)) 접두어 += "[분쇄]";
                                if (로그.스킬.includes(7)) 접두어 += "[처형]";
                                if (로그.스킬.includes(8)) 접두어 += "[조준]";
                                if (로그.스킬.includes(9)) 접두어 += "[쇠약]";

                                window[`${i}${j}로그`].innerHTML =
                                    `${접두어} ${로그.피해.toLocaleString()}`;

                            }

                            if (Number(j) === 결과.전투결과.전투로그[i].length - 1) {
                                객체생성(window[`${i}턴로그`], `${i}내정보상대정보`, "", "양쪽", "", "");

                                객체생성(window[`${i}내정보상대정보`], `${i}내정보`, "플렉스일", "테두리", "세로", "여백");
                                객체생성(window[`${i}내정보`], `${i}내이름`, "", "", "", "여백");
                                window[`${i}내이름`].innerHTML = 유저.스탯.닉네임;
                                객체생성(window[`${i}내정보`], `${i}내체력`, "", "가로꽉", "", "작게");
                                window[`${i}내체력`].innerHTML = `${숫자로만(결과.전투결과.전투로그[i][j].나남은체력)}/${숫자로만(유저.스탯.최종체력)}`;
                                window[`${i}내체력`].style.backgroundColor = 색상맵[`진빨`];
                                window[`${i}내체력`].style.width = `${100 * 결과.전투결과.전투로그[i][j].나남은체력 / 유저.스탯.최종체력}%`;
                                window[`${i}내정보`].style.border = `1px solid ${색상맵[`진파`]}`;

                                객체생성(window[`${i}내정보상대정보`], `${i}상대정보`, "플렉스일", "테두리", "세로", "여백");
                                객체생성(window[`${i}상대정보`], `${i}상대이름`, "", "", "", "여백");
                                window[`${i}상대이름`].innerHTML = 결과.몬스터.스탯.히든 ? 히든몬스터[결과.몬스터.스탯.번호 - 1] : 일반몬스터[결과.몬스터.스탯.번호 - 1];
                                객체생성(window[`${i}상대정보`], `${i}상대체력`, "", "가로꽉", "", "작게");
                                window[`${i}상대체력`].innerHTML = `${숫자로만(결과.전투결과.전투로그[i][j].상대남은체력)}/${숫자로만(결과.몬스터.스탯.최종체력)}`;
                                window[`${i}상대체력`].style.backgroundColor = 색상맵[`진빨`];
                                window[`${i}상대체력`].style.width = `${100 * 결과.전투결과.전투로그[i][j].상대남은체력 / 결과.몬스터.스탯.최종체력}%`;
                                window[`${i}상대정보`].style.border = `1px solid ${색상맵[`중빨`]}`;


                            }
                        }


                    }

                } else {
                    알림창표시(결과.오류);
                }

            } catch (error) {
                console.log(error);
            } finally {
                화면해제();
            }
        };

        반자동.onclick = () => {
            자동플래그 = 자동플래그 ? 0 : 1;
            악마성.onclick();
        };

        풀자동.onclick = () => {
            자동플래그 = 자동플래그 ? 0 : 2;
            악마성.onclick();
        };

        무자동.onclick = () => {
            자동플래그 = 자동플래그 ? 0 : 3;
            악마성.onclick();
        };


    } catch (error) {
        console.log(error);
    } finally {
        화면해제();
    }
}

가글전투.onclick = async () => {
    try {
        if (가글전투컨테이너.style.display === "none") {
            가글전투화면();
        }
    } catch (error) {
        console.log(error);
    } finally {
        화면해제();
    }
};

객체생성(document.body, "가글설정컨테이너", "사백", "테두리", "세로", "내부", "숨기기");

//가글설정화면함수
async function 가글설정화면() {
    try {
        화면잠금(``);
        가글화면전환(가글설정컨테이너);
        가글설정컨테이너.innerHTML = ``;

        객체생성(가글설정컨테이너, "가글설정설명", "가로꽉", "밑줄", "여백");
        가글설정설명.innerHTML = `각종 설정을 변경할 수 있습니다<br>
        모든 설정변경에는 스태미너(1)가 소모됩니다`;

        객체생성(가글설정컨테이너, "닉네임변경박스", "테두리", "가로꽉", "여백", "세로");
        객체생성(닉네임변경박스, "닉네임변경설명", "밑줄", "가로꽉", "여백");
        닉네임변경설명.innerHTML = `닉네임을 변경해보세요`;
        인풋객체생성(닉네임변경박스, "닉네임변경", "", "", "여백");
        닉네임변경.type = "text";
        닉네임변경.placeholder = "닉넴 입력";
        객체생성(닉네임변경박스, "닉네임변경확인", "테두리", "버튼", "여백");
        닉네임변경확인.innerHTML = `변경`;

        닉네임변경.addEventListener("input", () => {
            let 원본 = 닉네임변경.value;

            // 한글만 허용
            let 한글만 = 원본.replace(/[^ㄱ-ㅎㅏ-ㅣ가-힣]/g, "");
            if (원본 !== 한글만) {
                알림창표시("한글만 가능합니다");
                원본 = 한글만;     // 지금부터 원본을 한글만으로 업데이트
            }

            // 최대 6글자 제한
            if (원본.length > 6) {
                원본 = 원본.slice(0, 6);
                알림창표시("최대 6글자입니다");
            }

            닉네임변경.value = 원본;
        });

        닉네임변경.addEventListener("keydown", async (e) => {
            // 엔터키
            if (e.key === "Enter") {
                try {
                    화면잠금(`닉네임 변경중입니다`);

                    if (!유저.스탯.현재스태미너) {
                        알림창표시("스태미너가 부족합니다");
                        return;
                    }

                    const id값 = 닉네임변경.value.trim();

                    if (!id값) {
                        알림창표시("변경하고 싶은 닉넴을 입력하세요");
                        return;
                    }

                    // 한글만 허용
                    if (!/^[ㄱ-ㅎㅏ-ㅣ가-힣]+$/.test(id값)) {
                        알림창표시("아이디는 한글만 가능합니다");
                        return;
                    }

                    const 응답 = await fetch("/rkrmf", {
                        method: "POST",
                        headers: { "Content-Type": "application/json" },
                        body: JSON.stringify({
                            액션: "닉네임변경",
                            액션데이터: { 유저id: 유저.id, 닉넴: id값 }
                        })
                    });

                    const 결과 = await 응답.json();

                    if (결과.성공) {
                        알림창표시("닉네임이 변경되었습니다");

                        유저 = 결과.가글;
                        서브 = 결과.가글서브;

                        게임이름.innerHTML = 유저.스탯.닉네임;

                        닉네임변경.value = "";

                    } else {
                        알림창표시(결과.오류);
                    }


                } catch (error) {
                    console.log(error);
                } finally {
                    화면해제();
                }
            }

            // 스페이스바 (원하는 경우만)
            if (e.key === " ") {    // 또는 e.code === "Space"
                e.preventDefault(); // 스페이스 입력 막음
            }
        });

        닉네임변경확인.onclick = async () => {
            try {
                화면잠금(`닉네임 변경중입니다`);

                if (!유저.스탯.현재스태미너) {
                    알림창표시("스태미너가 부족합니다");
                    return;
                }

                const id값 = 닉네임변경.value.trim();

                if (!id값) {
                    알림창표시("변경하고 싶은 닉넴을 입력하세요");
                    return;
                }

                // 한글만 허용
                if (!/^[ㄱ-ㅎㅏ-ㅣ가-힣]+$/.test(id값)) {
                    알림창표시("아이디는 한글만 가능합니다");
                    return;
                }

                const 응답 = await fetch("/rkrmf", {
                    method: "POST",
                    headers: { "Content-Type": "application/json" },
                    body: JSON.stringify({
                        액션: "닉네임변경",
                        액션데이터: { 유저id: 유저.id, 닉넴: id값 }
                    })
                });

                const 결과 = await 응답.json();

                if (결과.성공) {
                    알림창표시("닉네임이 변경되었습니다");

                    유저 = 결과.가글;

                    게임이름.innerHTML = 유저.스탯.닉네임;

                    닉네임변경.value = "";

                } else {
                    알림창표시(결과.오류);
                }


            } catch (error) {
                console.log(error);
            } finally {
                화면해제();
            }
        };




        객체생성(가글설정컨테이너, "장비이름변경박스", "테두리", "가로꽉", "여백", "세로");
        객체생성(장비이름변경박스, "장비이름변경박스설명", "밑줄", "가로꽉", "여백");
        장비이름변경박스설명.innerHTML = `
        장비의 이름을 변경하세요<br>
        모든문자를 입력할 수 있지만 글자제한은 6자입니다<br>
        눈쌀 찌푸려질 단어들은 제재하겠습니다 지양해주세요
        `;



        const 장비이름변경맵 = {
            0: "무기", 1: "방어구", 2: "장신구", 3: "날개"
        };

        for (const a in 장비이름변경맵) {
            객체생성(장비이름변경박스, `${장비이름변경맵[a]}이름변경박스`, "테두리", "양쪽", "여백");
            인풋객체생성(window[`${장비이름변경맵[a]}이름변경박스`], `${장비이름변경맵[a]}이름변경`, "", "", "여백");
            window[`${장비이름변경맵[a]}이름변경`].type = "text";
            window[`${장비이름변경맵[a]}이름변경`].placeholder = `${장비이름변경맵[a]}이름 입력`;

            객체생성(window[`${장비이름변경맵[a]}이름변경박스`], `${장비이름변경맵[a]}이름변경확인`, "테두리", "버튼", "여백");
            window[`${장비이름변경맵[a]}이름변경확인`].innerHTML = `${장비이름변경맵[a]}이름변경`;

            window[`${장비이름변경맵[a]}이름변경`].addEventListener("input", (e) => {

                let 원본 = window[`${장비이름변경맵[a]}이름변경`].value;

                // 최대 6글자 제한
                if (원본.length > 6) {
                    원본 = 원본.slice(0, 6);
                    알림창표시("최대 6글자입니다");
                }

                window[`${장비이름변경맵[a]}이름변경`].value = 원본;
            });

            window[`${장비이름변경맵[a]}이름변경`].addEventListener("keydown", async (e) => {
                // 엔터키
                if (e.key === "Enter") {
                    try {
                        화면잠금(`${장비이름변경맵[a]}의 이름을 변경중입니다`);

                        if (!유저.스탯.현재스태미너) {
                            알림창표시("스태미너가 부족합니다");
                            return;
                        }

                        const id값 = window[`${장비이름변경맵[a]}이름변경`].value.trim();

                        if (!id값) {
                            알림창표시("이름을 입력하세요");
                            return;
                        }

                        const 응답 = await fetch("/rkrmf", {
                            method: "POST",
                            headers: { "Content-Type": "application/json" },
                            body: JSON.stringify({
                                액션: "장비이름변경",
                                액션데이터: { 유저id: 유저.id, 장비: 장비이름변경맵[a], 장비이름: id값 }
                            })
                        });

                        const 결과 = await 응답.json();

                        if (결과.성공) {
                            알림창표시(`${장비이름변경맵[a]}의 이름이 변경되었습니다`);

                            유저 = 결과.data;

                            window[`${장비이름변경맵[a]}이름변경`].value = "";

                        } else {
                            알림창표시(결과.오류);
                        }


                    } catch (error) {
                        console.log(error);
                    } finally {
                        화면해제();
                    }
                }

                // 스페이스바 (원하는 경우만)
                if (e.key === " ") {    // 또는 e.code === "Space"
                    e.preventDefault(); // 스페이스 입력 막음
                }
            });

            window[`${장비이름변경맵[a]}이름변경확인`].onclick = async () => {
                try {
                    화면잠금(`${장비이름변경맵[a]}의 이름을 변경중입니다`);

                    if (!유저.스탯.현재스태미너) {
                        알림창표시("스태미너가 부족합니다");
                        return;
                    }

                    const id값 = window[`${장비이름변경맵[a]}이름변경`].value.trim();

                    if (!id값) {
                        알림창표시("이름을 입력하세요");
                        return;
                    }

                    const 응답 = await fetch("/rkrmf", {
                        method: "POST",
                        headers: { "Content-Type": "application/json" },
                        body: JSON.stringify({
                            액션: "장비이름변경",
                            액션데이터: { 유저id: 유저.id, 장비: 장비이름변경맵[a], 장비이름: id값 }
                        })
                    });

                    const 결과 = await 응답.json();

                    if (결과.성공) {
                        알림창표시(`${장비이름변경맵[a]}의 이름이 변경되었습니다`);

                        유저 = 결과.data;

                        window[`${장비이름변경맵[a]}이름변경`].value = "";

                    } else {
                        알림창표시(결과.오류);
                    }

                } catch (error) {
                    console.log(error);
                } finally {
                    화면해제();
                }
            };

        }



        객체생성(가글설정컨테이너, "시작화면변경", "테두리", "가로꽉", "여백", "세로");
        객체생성(시작화면변경, "시작화면변경설명", "", "가로꽉", "여백", "밑줄");
        시작화면변경설명.innerHTML = `게임 시작시 실행되는 화면을 변경할 수 있습니다`;

        let 화면모음컨테이너 = 0;

        for (let i = 0; i < 화면목록.length; i++) {
            const 선택된화면 = 유저.스탯.화면번호 === i ? "선택" : "";
            const id = `화면${i}`;
            if (i % 5 === 0) {
                화면모음컨테이너++;
                객체생성(시작화면변경, `화면모음${화면모음컨테이너}`, "", "", "", "");
            }

            객체생성(window[`화면모음${화면모음컨테이너}`], id, "버튼", "테두리", "여백", "", 선택된화면);
            window[id].innerHTML = 화면목록[i].이름;

            window[id].onclick = async () => {
                try {
                    화면잠금(`시작화면 변경중입니다`);

                    if (!유저.스탯.현재스태미너) {
                        알림창표시("스태미너가 부족합니다");
                        return;
                    }

                    const 응답 = await fetch("/rkrmf", {
                        method: "POST",
                        headers: { "Content-Type": "application/json" },
                        body: JSON.stringify({
                            액션: "시작화면변경",
                            액션데이터: { 유저id: 유저.id, 화면번호: i }
                        })
                    });

                    const 결과 = await 응답.json();

                    if (결과.성공) {

                        유저 = 결과.가글;

                        가글설정화면();

                        알림창표시(`시작화면이 ${화면목록[i].이름}화면으로 변경되었습니다`);
                    } else {
                        알림창표시(결과.오류);
                    }

                } catch (error) {
                    console.log(error);
                } finally {
                    화면해제();
                }
            };

        }

    } catch (error) {
        console.log(error);
    } finally {
        화면해제();
    }
}

가글설정.onclick = async () => {
    try {
        if (가글설정컨테이너.style.display === "none") {
            가글설정화면();
        }
    } catch (error) {
        console.log(error);
    } finally {
        화면해제();
    }
};

객체생성(document.body, "가글주인장컨테이너", "사백", "테두리", "세로", "내부", "숨기기");

//가글주인장화면함수
async function 가글주인장화면() {
    try {
        화면잠금(`당신이 주인장이 아니라면 큰 화를 당하실거요`);
        가글화면전환(가글주인장컨테이너);

        가글주인장컨테이너.innerHTML = ``;

        객체생성(가글주인장컨테이너, "가글주인장설명", "가로꽉", "밑줄", "여백");
        가글주인장설명.innerHTML = `주인장 전용화면`;





        객체생성(가글주인장컨테이너, "그때그때필요한거", "테두리", "버튼", "여백");
        그때그때필요한거.innerHTML = `그때그때필요한거`;

        그때그때필요한거.onclick = async () => {
            try {
                화면잠금();

                if (!유저.스탯.주인장) {
                    알림창표시(`돌아가쇼`);
                    return;
                }

                const 응답 = await fetch("/rkrmf", {
                    method: "POST",
                    headers: { "Content-Type": "application/json" },
                    body: JSON.stringify({
                        액션: "그때그때필요한거",
                        액션데이터: { 유저id: 유저.id }
                    })
                });

                const 결과 = await 응답.json();

                if (결과.성공) {
                    알림창표시("그때그때필요한거");
                    유저 = 결과.data;

                } else {
                    알림창표시(결과.오류);
                }

            } catch (error) {
                console.log(error);
            } finally {
                화면해제();
            }
        };






        객체생성(가글주인장컨테이너, "주인장스태회복", "테두리", "버튼", "여백");
        주인장스태회복.innerHTML = `스태회복`;

        주인장스태회복.onclick = async () => {
            try {
                화면잠금();

                if (!유저.스탯.주인장) {
                    알림창표시(`돌아가쇼`);
                    return;
                }

                const 응답 = await fetch("/rkrmf", {
                    method: "POST",
                    headers: { "Content-Type": "application/json" },
                    body: JSON.stringify({
                        액션: "주인장스태회복",
                        액션데이터: { 유저id: 유저.id }
                    })
                });

                const 결과 = await 응답.json();

                if (결과.성공) {
                    유저 = 결과.가글;
                    가글주인장화면();
                    알림창표시("스태회복했음");

                } else {
                    알림창표시(결과.오류);
                }

            } catch (error) {
                console.log(error);
            } finally {
                화면해제();
            }
        };

        객체생성(가글주인장컨테이너, "주인장숙련도회복", "테두리", "버튼", "여백");
        주인장숙련도회복.innerHTML = `숙련도회복`;

        주인장숙련도회복.onclick = async () => {
            try {
                화면잠금();

                if (!유저.스탯.주인장) {
                    알림창표시(`돌아가쇼`);
                    return;
                }

                const 응답 = await fetch("/rkrmf", {
                    method: "POST",
                    headers: { "Content-Type": "application/json" },
                    body: JSON.stringify({
                        액션: "주인장숙련도회복",
                        액션데이터: { 유저id: 유저.id }
                    })
                });

                const 결과 = await 응답.json();

                if (결과.성공) {
                    유저 = 결과.가글;
                    가글주인장화면();
                    알림창표시("숙련도회복했음");

                } else {
                    알림창표시(결과.오류);
                }

            } catch (error) {
                console.log(error);
            } finally {
                화면해제();
            }
        };


        객체생성(가글주인장컨테이너, "주인장골드오링", "테두리", "버튼", "여백");
        주인장골드오링.innerHTML = `골드오링`;

        주인장골드오링.onclick = async () => {
            try {
                화면잠금();

                if (!유저.스탯.주인장) {
                    알림창표시(`돌아가쇼`);
                    return;
                }

                const 응답 = await fetch("/rkrmf", {
                    method: "POST",
                    headers: { "Content-Type": "application/json" },
                    body: JSON.stringify({
                        액션: "주인장골드오링",
                        액션데이터: { 유저id: 유저.id }
                    })
                });

                const 결과 = await 응답.json();

                if (결과.성공) {
                    유저 = 결과.data;
                    가글주인장화면();
                    알림창표시("골드오링");

                } else {
                    알림창표시(결과.오류);
                }

            } catch (error) {
                console.log(error);
            } finally {
                화면해제();
            }
        };


        객체생성(가글주인장컨테이너, "점검때리기", "테두리", "버튼", "여백");
        점검때리기.innerHTML = `점검때리기`;

        점검때리기.onclick = async () => {
            try {
                화면잠금();

                if (!유저.스탯.주인장) {
                    알림창표시(`돌아가쇼`);
                    return;
                }

                const 응답 = await fetch("/rkrmf", {
                    method: "POST",
                    headers: { "Content-Type": "application/json" },
                    body: JSON.stringify({
                        액션: "점검때리기",
                        액션데이터: { 유저id: 유저.id }
                    })
                });

                const 결과 = await 응답.json();

                if (결과.성공) {
                    알림창표시("점검때렸음");

                } else {
                    알림창표시(결과.오류);
                }

            } catch (error) {
                console.log(error);
            } finally {
                화면해제();
            }
        };

        객체생성(가글주인장컨테이너, "점검해제", "테두리", "버튼", "여백");
        점검해제.innerHTML = `점검해제`;

        점검해제.onclick = async () => {
            try {
                화면잠금();

                if (!유저.스탯.주인장) {
                    알림창표시(`돌아가쇼`);
                    return;
                }

                const 응답 = await fetch("/rkrmf", {
                    method: "POST",
                    headers: { "Content-Type": "application/json" },
                    body: JSON.stringify({
                        액션: "점검해제",
                        액션데이터: { 유저id: 유저.id }
                    })
                });

                const 결과 = await 응답.json();

                if (결과.성공) {
                    알림창표시("점검해제했음");

                } else {
                    알림창표시(결과.오류);
                }

            } catch (error) {
                console.log(error);
            } finally {
                화면해제();
            }
        };

        객체생성(가글주인장컨테이너, "업뎃때리기", "테두리", "버튼", "여백");
        업뎃때리기.innerHTML = `업뎃때리기`;

        업뎃때리기.onclick = async () => {
            try {
                화면잠금();

                if (!유저.스탯.주인장) {
                    알림창표시(`돌아가쇼`);
                    return;
                }

                const 응답 = await fetch("/rkrmf", {
                    method: "POST",
                    headers: { "Content-Type": "application/json" },
                    body: JSON.stringify({
                        액션: "업뎃때리기",
                        액션데이터: { 유저id: 유저.id }
                    })
                });

                const 결과 = await 응답.json();

                if (결과.성공) {
                    알림창표시("업뎃때렸음");

                } else {
                    알림창표시(결과.오류);
                }

            } catch (error) {
                console.log(error);
            } finally {
                화면해제();
            }
        };


        객체생성(가글주인장컨테이너, "일어난일리셋", "테두리", "버튼", "여백");
        일어난일리셋.innerHTML = `일어난일리셋`;

        일어난일리셋.onclick = async () => {
            try {
                화면잠금();

                if (!유저.스탯.주인장) {
                    알림창표시(`돌아가쇼`);
                    return;
                }

                const 응답 = await fetch("/rkrmf", {
                    method: "POST",
                    headers: { "Content-Type": "application/json" },
                    body: JSON.stringify({
                        액션: "일어난일리셋",
                        액션데이터: { 유저id: 유저.id }
                    })
                });

                const 결과 = await 응답.json();

                if (결과.성공) {
                    알림창표시("일어난일리셋했음");

                } else {
                    알림창표시(결과.오류);
                }

            } catch (error) {
                console.log(error);
            } finally {
                화면해제();
            }
        };

        객체생성(가글주인장컨테이너, "로그리셋", "테두리", "버튼", "여백");
        로그리셋.innerHTML = `로그리셋`;

        로그리셋.onclick = async () => {
            try {
                화면잠금();

                if (!유저.스탯.주인장) {
                    알림창표시(`돌아가쇼`);
                    return;
                }

                const 응답 = await fetch("/rkrmf", {
                    method: "POST",
                    headers: { "Content-Type": "application/json" },
                    body: JSON.stringify({
                        액션: "로그리셋",
                        액션데이터: { 유저id: 유저.id }
                    })
                });

                const 결과 = await 응답.json();

                if (결과.성공) {
                    알림창표시("로그리셋했음");

                } else {
                    알림창표시(결과.오류);
                }

            } catch (error) {
                console.log(error);
            } finally {
                화면해제();
            }
        };

        객체생성(가글주인장컨테이너, "광장초기화", "테두리", "버튼", "여백");
        광장초기화.innerHTML = `광장초기화`;

        광장초기화.onclick = async () => {
            try {
                화면잠금();

                if (!유저.스탯.주인장) {
                    알림창표시(`돌아가쇼`);
                    return;
                }

                const 응답 = await fetch("/rkrmf", {
                    method: "POST",
                    headers: { "Content-Type": "application/json" },
                    body: JSON.stringify({
                        액션: "광장초기화",
                        액션데이터: { 유저id: 유저.id }
                    })
                });

                const 결과 = await 응답.json();

                if (결과.성공) {
                    알림창표시("광장초기화했음");

                } else {
                    알림창표시(결과.오류);
                }

            } catch (error) {
                console.log(error);
            } finally {
                화면해제();
            }
        };

        객체생성(가글주인장컨테이너, "스태미너초기화", "테두리", "버튼", "여백");
        스태미너초기화.innerHTML = `스태미너초기화`;

        스태미너초기화.onclick = async () => {
            try {
                화면잠금();

                if (!유저.스탯.주인장) {
                    알림창표시(`돌아가쇼`);
                    return;
                }

                const 응답 = await fetch("/rkrmf", {
                    method: "POST",
                    headers: { "Content-Type": "application/json" },
                    body: JSON.stringify({
                        액션: "스태미너초기화",
                        액션데이터: { 유저id: 유저.id }
                    })
                });

                const 결과 = await 응답.json();

                if (결과.성공) {
                    알림창표시("스태미너초기화");

                    유저 = 결과.data;
                } else {
                    알림창표시(결과.오류);
                }

            } catch (error) {
                console.log(error);
            } finally {
                화면해제();
            }
        };





        객체생성(가글주인장컨테이너, "우편박스", "테두리", "가로꽉", "세로");

        인풋객체생성(우편박스, "우편이름", "", "", "여백");
        우편이름.type = "text";
        우편이름.placeholder = "우편이름";

        우편이름.addEventListener("focus", () => {
            const 우편이름목록 = [
                "햄버거",
                "샐러드",
                "골드",
            ];

            if (!window.우편이름드롭다운) {
                객체생성(document.body, "우편이름드롭다운", "세로", "테두리", "", "숨기기");
                우편이름드롭다운.style.position = "absolute";
                우편이름드롭다운.style.zIndex = "99999";
            }

            우편이름드롭다운.innerHTML = "";
            우편이름드롭다운.style.display = "flex";

            const rect = 우편이름.getBoundingClientRect();
            우편이름드롭다운.style.left = rect.left + "px";
            우편이름드롭다운.style.top = rect.bottom + "px";
            우편이름드롭다운.style.width = rect.width + "px";

            for (const 이름 of 우편이름목록) {
                객체생성(우편이름드롭다운, 이름, "버튼", "여백");
                window[이름].innerHTML = 이름;

                window[이름].onclick = () => {
                    우편이름.value = 이름;
                    우편이름드롭다운.style.display = "none";
                };
            }
        });

        인풋객체생성(우편박스, "우편수량", "", "", "여백");
        우편수량.type = "text";
        우편수량.placeholder = "우편수량";

        인풋객체생성(우편박스, "우편메모", "", "", "여백");
        우편메모.type = "text";
        우편메모.placeholder = "우편메모";

        인풋객체생성(우편박스, "우편받는이", "", "", "여백");
        우편받는이.type = "text";
        우편받는이.placeholder = "우편받는이";

        우편받는이.addEventListener("focus", async () => {
            const 응답 = await fetch("/rkrmf", {
                method: "POST",
                headers: { "Content-Type": "application/json" },
                body: JSON.stringify({
                    액션: "가글서브닉네임조회",
                    액션데이터: { 유저id: 유저.id }
                })
            });

            const 결과 = await 응답.json();

            if (결과.성공) {

                if (!window.닉네임드롭다운) {
                    객체생성(document.body, "닉네임드롭다운", "세로", "테두리", "", "숨기기");
                    닉네임드롭다운.style.position = "absolute";
                    닉네임드롭다운.style.zIndex = "99999";
                }

                닉네임드롭다운.innerHTML = "";
                닉네임드롭다운.style.display = "flex";

                const rect = 우편받는이.getBoundingClientRect();
                닉네임드롭다운.style.left = rect.left + "px";
                닉네임드롭다운.style.top = rect.bottom + "px";
                닉네임드롭다운.style.width = rect.width + "px";

                for (const 서브 of 결과.서브전체) {
                    const 닉네임 = 서브.스탯?.닉네임;
                    if (!닉네임) continue;

                    객체생성(닉네임드롭다운, 닉네임, "버튼", "여백");
                    window[닉네임].innerHTML = 닉네임;

                    window[닉네임].onclick = () => {
                        우편받는이.value = 닉네임;
                        닉네임드롭다운.style.display = "none";
                    };
                }

            } else {
                알림창표시(결과.오류);
            }

        });

        객체생성(우편박스, "한명보내기", "테두리", "버튼", "여백");
        한명보내기.innerHTML = `한명보내기`;

        한명보내기.onclick = async () => {
            try {
                화면잠금(`우편보내는중`);

                if (!유저.스탯.주인장) {
                    알림창표시("실패");
                    return;
                }

                const 새이름 = 우편이름.value.trim();

                if (!새이름) {
                    알림창표시("우편이름 없음");
                    return;
                }

                const 새수량 = 우편수량.value.trim();

                if (!새수량) {
                    알림창표시("우편수량 없음");
                    return;
                }

                const 새메모 = 우편메모.value.trim();

                if (!우편메모) {
                    알림창표시("우편메모 없음");
                    return;
                }

                const 응답 = await fetch("/rkrmf", {
                    method: "POST",
                    headers: { "Content-Type": "application/json" },
                    body: JSON.stringify({
                        액션: "우편한명보내기",
                        액션데이터: { 유저id: 유저.id, 새이름, 새수량, 새메모, 닉네임: 우편받는이.value.trim() }
                    })
                });

                const 결과 = await 응답.json();

                if (결과.성공) {
                    알림창표시("우편을 보냈습니다");

                } else {
                    알림창표시(결과.오류);
                }


            } catch (error) {
                console.log(error);
            } finally {
                화면해제();
            }
        };



        객체생성(우편박스, "전체보내기", "테두리", "버튼", "여백");
        전체보내기.innerHTML = `전체보내기`;

        전체보내기.onclick = async () => {
            try {
                화면잠금(`우편보내는중`);

                if (!유저.스탯.주인장) {
                    알림창표시("실패");
                    return;
                }

                const 새이름 = 우편이름.value.trim();

                if (!새이름) {
                    알림창표시("우편이름 없음");
                    return;
                }

                const 새수량 = 우편수량.value.trim();

                if (!새수량) {
                    알림창표시("우편수량 없음");
                    return;
                }

                const 새메모 = 우편메모.value.trim();

                if (!우편메모) {
                    알림창표시("우편메모 없음");
                    return;
                }

                const 응답 = await fetch("/rkrmf", {
                    method: "POST",
                    headers: { "Content-Type": "application/json" },
                    body: JSON.stringify({
                        액션: "우편전체보내기",
                        액션데이터: { 유저id: 유저.id, 새이름, 새수량, 새메모, 아이디: null }
                    })
                });

                const 결과 = await 응답.json();

                if (결과.성공) {
                    알림창표시("우편을 보냈습니다");

                } else {
                    알림창표시(결과.오류);
                }

            } catch (error) {
                console.log(error);
            } finally {
                화면해제();
            }
        };












    } catch (error) {
        console.log(error);
    } finally {
        화면해제();
    }
}

가글주인장.onclick = async () => {
    try {
        if (가글주인장컨테이너.style.display === "none") {
            가글주인장화면();
        }
    } catch (error) {
        console.log(error);
    } finally {
        화면해제();
    }
};

객체생성(document.body, "가글메뉴얼컨테이너", "사백", "테두리", "세로", "내부", "숨기기");

//가글메뉴얼화면함수
async function 가글메뉴얼화면() {
    try {
        화면잠금(``);
        가글화면전환(가글메뉴얼컨테이너);

        가글메뉴얼컨테이너.innerHTML = ``;

        객체생성(가글메뉴얼컨테이너, "가글메뉴얼설명", "가로꽉", "밑줄", "여백");
        가글메뉴얼설명.innerHTML = `가글의 시스템을 최대한 기재해보겠습니다`;

        객체생성(가글메뉴얼컨테이너, "메뉴얼아이콘", "", "세로", "여백");
        메뉴얼아이콘.innerHTML = `<br>` + 큰아이콘.투띵크;

        객체생성(가글메뉴얼컨테이너, "메뉴얼모음", "", "", "여백");
        메뉴얼모음.innerHTML = `
        <br>
        버전 업데이트 시 주인장이 우편을 보냅니다<br>
        설정에서 시작화면을 우편함 화면으로 해놓으시면<br>
        우편물 확인으로 버전 업데이트를 빠르게 확인할 수 있습니다<br>
        <br>
        스태미너는 정시마다 120씩 회복됩니다<br>
        스태미너는 최대스태미너를 초과하여 회복되지 않습니다<br>
        <br>
        전투화면에서 악마성을 클릭하여 전투를 진행할 수 있습니다<br>
        층마다 1번부터 72번까지 고유번호가 부여된 72악마가 일반몬스터로 등장합니다<br>
        경험치와 골드는 몬스터번호 * 층수 로 획득됩니다<br>
        숙련도는 층수로 획득됩니다<br>
        72마리의 일반몬스터 중 11번 악마는 경험치를 200배로<br>
        33번 악마는 골드를 200배로, 66번 악마는 숙련도를 200배로 제공합니다<br>
        <br>
        악마성 전투중 3%의 확률로 '재앙'맵이 등장합니다<br>
        재앙에서는 72악마와 별개로 셋팅된 9종의 히든몬스터들이 등장합니다<br>
        1번 릴리트(66.6%) 2번 디아블로(22.2%)<br>
        3번 레비아탄(7.4%) 4번 벨제부브(2.4%)<br>
        5번 사탄(0.8%) 6번 루시퍼(0.2%)<br>
        7번 베히모스(0.09%) 8번 아바돈(0.03%)<br>
        9번 바론(0.01%)<br>
        <br>
        히든몬스터들은 1.n(번호)배 스탯버프되어있습니다<br>
        ex) 2층 일반몬스터 1~72번 전투력 9,999<br>
        ex) 2층 히든몬스터 3번(레비아탄) 전투력 9,999 * 1.3 = 12,998<br>
        <br>
        반자동 시 일반몬스터를 자동사냥하며 재앙 등장 시 멈춥니다<br>
        풀자동 시 히든몬스터를 포함한 모든 몬스터를 자동사냥합니다<br>
        모든 자동사냥은 패배 시 종료됩니다<br>
        패배해도 멈추지 않는 무자동 버튼이 추가되었습니다<br>
        <br>
        체력이 0이 되는 순간 풀피로 자동회복됩니다<br>
        죽음 외에 체력을 회복하는 수단은 스킬뿐입니다<br>
        <br>
        재앙에서 등장하는 히든몬스터들과의 전투에서 승리 시<br>
        확정적으로 고유 유물을 드랍할 수 있습니다<br>
        <br>
        모든 일반몬스터와 모든 히든몬스터들이 영혼을 드랍합니다<br>
        각 층에서 획득한 영혼은 다음 층 악마들의 최종스탯을<br>
        감소시킵니다<br>
        <br>
        설정화면에서 닉네임을 변경할 수 있습니다<br>
        설정화면에서 장비들의 이름을 변경할 수 있습니다<br>
        설정화면에서 게임 시작화면을 변경할 수 있습니다<br>
        <br>
        화면에 생성되는 팝업창은 취소버튼 외<br>
        팝업 외부 클릭시에도 사라집니다<br>
        <br>
        스탯 중 속력은 선공권을 결정합니다<br>
        가글에서는 연속공격 효과가 오로지 속력에 의해서 결정되고<br>
        (속력 × 0.01)%의 확률로 2~5회의 랜덤한 연속공격을합니다<br>
        <br>
        정보 - 일어난일 에는 장비리롤 백분율 중 5이하 95이상의<br>
        사건이 기록됩니다<br>
        그리고 재앙몬스터들 중 6등급 이상의 히든몬스터들에게<br>
        승리시에도 기록됩니다<br>
        <br>
        등급 정의<br>
        일반 - 레어 - 신화 - 고대 - 태초 - 타락 - 진화 - 멸망 - 공허<br>
        <br>
        최종데미지 = Math.floor(Math.max(1, ((나최종공격력 * 상대쇠약) - (상대최종방어력 * 나분쇄)) * 나과열 * 나치명 * 나조준 * 랜덤배율))<br>
        랜덤배율 범위 80~110%<br>
        



        <br>
        `;

        //메뉴얼작성
        //화살표 ➡
        //곱하기 ×
        //공백 　

    } catch (error) {
        console.log(error);
    } finally {
        화면해제();
    }
}

가글메뉴얼.onclick = async () => {
    try {
        if (가글메뉴얼컨테이너.style.display === "none") {
            가글메뉴얼화면();
        }
    } catch (error) {
        console.log(error);
    } finally {
        화면해제();
    }
};

객체생성(document.body, "가글장비컨테이너", "사백", "테두리", "세로", "내부", "숨기기");

//가글장비화면함수
async function 가글장비화면() {
    try {
        화면잠금(``);
        가글화면전환(가글장비컨테이너);

        가글장비컨테이너.innerHTML = ``;

        객체생성(가글장비컨테이너, "가글장비설명", "가로꽉", "밑줄", "여백");
        가글장비설명.innerHTML = `원하는 장비의 옵션을 파밍하거나 승급시킬 수 있습니다<br>
        각 스탯의 괄호에 표시된 수치는 해당장비의 등급에서<br>
        등장할 수 있는 최대수치에 대한 백분율입니다<br>
        `;

        객체생성(가글장비컨테이너, "보유숙보유골", "양쪽", "밑줄", "");
        객체생성(보유숙보유골, "보유숙필요숙", "세로", "플렉스일", "여백");
        객체생성(보유숙필요숙, "보유숙", "왼쪽", "", "여백");
        보유숙.innerHTML = `현재숙련도 ${숫자한글(유저.스탯.현재숙련도)}`;

        // 객체생성(보유숙필요숙, "다음숙", "왼쪽", "", "여백");
        // 다음숙.innerHTML = `필요숙련도 ${숫자한글(1000 * (3 ** (유저.스탯.무기.등급 - 1)))}`;

        객체생성(보유숙보유골, "보유골", "플렉스일", "오른쪽", "여백");
        보유골.innerHTML = `보유Gold ${숫자한글(유저.스탯.현재골드)}`;


        객체생성(가글장비컨테이너, "무기컨테이너", "가로꽉", "테두리", "세로", "여백");

        객체생성(무기컨테이너, "무기모든기능", "", "가로꽉", "세로");

        객체생성(무기모든기능, "무기이름과공", "양쪽", "", "", "밑줄");
        객체생성(무기이름과공, "무기이름", "", "", "여백");
        무기이름.innerHTML = 유저.스탯.무기.이름 ? `[${등급[유저.스탯.무기.등급].이름}] ${유저.스탯.무기.이름}` : `[${등급[유저.스탯.무기.등급].이름}] ${유저.스탯.닉네임}의 무기`;
        무기이름.style.color = 색상맵[등급[유저.스탯.무기.등급].색상];

        무기이름.className = 클래스맵[유저.스탯.무기.등급] ?? "";


        객체생성(무기이름과공, "무기공", "", "", "여백");
        무기공.innerHTML =
            `공격력 +${유저.스탯.무기.공격력} (` +
            `${Math.floor(
                (
                    (유저.스탯.무기.공격력 - ((유저.스탯.무기.등급 - 0.5) * 60)) /
                    (((유저.스탯.무기.등급 + 0.5) * 60) - ((유저.스탯.무기.등급 - 0.5) * 60))
                ) * 100
            )}%)`;


        객체생성(무기모든기능, "무기승급과리롤", "", "", "양쪽", "");
        객체생성(무기승급과리롤, "무기승급", "여백", "버튼", "테두리", "");
        무기승급.innerHTML = `
        무기승급<br>
        (숙련도${숫자한글(1000 * (3 ** (유저.스탯.무기.등급 - 1)))})<br>
        `;

        무기승급.onclick = async () => {
            try {
                화면잠금();

                if (유저.스탯.무기.등급 > 8) {
                    알림창표시(`최고등급입니다`);
                    return;

                }
                if (유저.스탯.현재숙련도 < 1000 * (3 ** (유저.스탯.무기.등급 - 1))) {
                    알림창표시(`숙련도가 부족합니다`);
                    return;
                }

                const 응답 = await fetch("/rkrmf", {
                    method: "POST",
                    headers: { "Content-Type": "application/json" },
                    body: JSON.stringify({
                        액션: "무기승급",
                        액션데이터: { 유저id: 유저.id }
                    })
                });

                const 결과 = await 응답.json();

                if (결과.성공) {
                    유저 = 결과.가글;
                    가글장비화면();
                    알림창표시(`${등급[유저.스탯.무기.등급].이름}등급으로 승급 성공`);
                } else {
                    알림창표시(결과.오류);
                }

            } catch (error) {
                console.log(error);
            } finally {
                화면해제();
            }
        };

        객체생성(무기승급과리롤, "무기리롤", "여백", "버튼", "테두리", "");
        무기리롤.innerHTML = `
        공격력리롤<br>
        (등장범위${(유저.스탯.무기.등급 - 0.5) * 60}~${(유저.스탯.무기.등급 + 0.5) * 60})<br>
        비용 ${숫자한글(1000 * (3 ** (유저.스탯.무기.등급 - 1)))}Gold
        `;

        무기리롤.onclick = async () => {
            try {
                화면잠금();

                if (유저.스탯.현재골드 < 1000 * (3 ** (유저.스탯.무기.등급 - 1))) {
                    알림창표시(`[${등급[유저.스탯.무기.등급].이름}]의 리롤비용은 ${숫자한글(1000 * (3 ** (유저.스탯.무기.등급 - 1)))}Gold입니다`);
                    return;
                }

                const 응답 = await fetch("/rkrmf", {
                    method: "POST",
                    headers: { "Content-Type": "application/json" },
                    body: JSON.stringify({
                        액션: "무기리롤",
                        액션데이터: { 유저id: 유저.id }
                    })
                });

                const 결과 = await 응답.json();

                if (결과.성공) {
                    유저 = 결과.가글;
                    가글장비화면();
                    알림창표시("무기 공격력 리롤 성공");
                } else {
                    알림창표시(결과.오류);
                }

            } catch (error) {
                console.log(error);
            } finally {
                화면해제();
            }
        };

        객체생성(가글장비컨테이너, "방어구컨테이너", "가로꽉", "테두리", "세로", "여백");


        객체생성(방어구컨테이너, "방어구모든기능", "", "가로꽉", "세로");

        객체생성(방어구모든기능, "방어구이름과방어력", "양쪽", "", "", "밑줄");
        객체생성(방어구이름과방어력, "방어구이름", "", "", "여백");
        방어구이름.innerHTML = 유저.스탯.방어구.이름 ? `[${등급[유저.스탯.방어구.등급].이름}] ${유저.스탯.방어구.이름}` : `[${등급[유저.스탯.방어구.등급].이름}] ${유저.스탯.닉네임}의 방어구`;
        방어구이름.style.color = 색상맵[등급[유저.스탯.방어구.등급].색상];

        방어구이름.className = 클래스맵[유저.스탯.방어구.등급] ?? "";

        객체생성(방어구이름과방어력, "방어구방어력", "", "", "여백");
        방어구방어력.innerHTML =
            `방어력 +${유저.스탯.방어구.방어력} (` +
            `${Math.floor(
                (
                    (유저.스탯.방어구.방어력 - ((유저.스탯.방어구.등급 - 0.5) * 20)) /
                    (((유저.스탯.방어구.등급 + 0.5) * 20) - ((유저.스탯.방어구.등급 - 0.5) * 20))
                ) * 100
            )}%)`;


        객체생성(방어구모든기능, "방어구승급과리롤", "", "", "양쪽", "");
        객체생성(방어구승급과리롤, "방어구승급", "여백", "버튼", "테두리", "");
        방어구승급.innerHTML = `
        방어구승급<br>
        (숙련도${숫자한글(1000 * (3 ** (유저.스탯.방어구.등급 - 1)))})<br>
        `;

        방어구승급.onclick = async () => {
            try {
                화면잠금();

                if (유저.스탯.방어구.등급 > 8) {
                    알림창표시(`최고등급입니다`);
                    return;

                }
                if (유저.스탯.현재숙련도 < 1000 * (3 ** (유저.스탯.방어구.등급 - 1))) {
                    알림창표시(`숙련도가 부족합니다`);
                    return;
                }

                const 응답 = await fetch("/rkrmf", {
                    method: "POST",
                    headers: { "Content-Type": "application/json" },
                    body: JSON.stringify({
                        액션: "방어구승급",
                        액션데이터: { 유저id: 유저.id }
                    })
                });

                const 결과 = await 응답.json();

                if (결과.성공) {
                    유저 = 결과.가글;
                    가글장비화면();
                    알림창표시(`${등급[유저.스탯.방어구.등급].이름}등급으로 승급 성공`);
                } else {
                    알림창표시(결과.오류);
                }

            } catch (error) {
                console.log(error);
            } finally {
                화면해제();
            }
        };

        객체생성(방어구승급과리롤, "방어구리롤", "여백", "버튼", "테두리", "");
        방어구리롤.innerHTML = `
        방어력리롤<br>
        (등장범위${(유저.스탯.방어구.등급 - 0.5) * 20}~${(유저.스탯.방어구.등급 + 0.5) * 20})<br>
        비용 ${숫자한글(1000 * (3 ** (유저.스탯.방어구.등급 - 1)))}Gold
        `;

        방어구리롤.onclick = async () => {
            try {
                화면잠금();

                if (유저.스탯.현재골드 < 1000 * (3 ** (유저.스탯.방어구.등급 - 1))) {
                    알림창표시(`[${등급[유저.스탯.방어구.등급].이름}]의 리롤비용은 ${숫자한글(1000 * (3 ** (유저.스탯.방어구.등급 - 1)))}Gold입니다`);
                    return;
                }

                const 응답 = await fetch("/rkrmf", {
                    method: "POST",
                    headers: { "Content-Type": "application/json" },
                    body: JSON.stringify({
                        액션: "방어구리롤",
                        액션데이터: { 유저id: 유저.id }
                    })
                });

                const 결과 = await 응답.json();

                if (결과.성공) {
                    유저 = 결과.가글;
                    가글장비화면();
                    알림창표시("방어구 방어력 리롤 성공");
                } else {
                    알림창표시(결과.오류);
                }

            } catch (error) {
                console.log(error);
            } finally {
                화면해제();
            }
        };



        객체생성(가글장비컨테이너, "장신구컨테이너", "가로꽉", "테두리", "세로", "여백");

        객체생성(장신구컨테이너, "장신구모든기능", "", "가로꽉", "세로");

        객체생성(장신구모든기능, "장신구이름과체력", "양쪽", "", "", "밑줄");
        객체생성(장신구이름과체력, "장신구이름", "", "", "여백");
        장신구이름.innerHTML = 유저.스탯.장신구.이름 ? `[${등급[유저.스탯.장신구.등급].이름}] ${유저.스탯.장신구.이름}` : `[${등급[유저.스탯.장신구.등급].이름}] ${유저.스탯.닉네임}의 장신구`;
        장신구이름.style.color = 색상맵[등급[유저.스탯.장신구.등급].색상];

        장신구이름.className = 클래스맵[유저.스탯.장신구.등급] ?? "";

        객체생성(장신구이름과체력, "장신구체력", "", "", "여백");
        장신구체력.innerHTML =
            `체력 +${유저.스탯.장신구.체력} (` +
            `${Math.floor(
                (
                    (유저.스탯.장신구.체력 - ((유저.스탯.장신구.등급 - 0.5) * 1000)) /
                    (((유저.스탯.장신구.등급 + 0.5) * 1000) - ((유저.스탯.장신구.등급 - 0.5) * 1000))
                ) * 100
            )}%)`;


        객체생성(장신구모든기능, "장신구승급과리롤", "", "", "양쪽", "");
        객체생성(장신구승급과리롤, "장신구승급", "여백", "버튼", "테두리", "");
        장신구승급.innerHTML = `
        장신구승급<br>
        (숙련도${숫자한글(1000 * (3 ** (유저.스탯.장신구.등급 - 1)))})<br>
        `;

        장신구승급.onclick = async () => {
            try {
                화면잠금();

                if (유저.스탯.장신구.등급 > 8) {
                    알림창표시(`최고등급입니다`);
                    return;

                }
                if (유저.스탯.현재숙련도 < 1000 * (3 ** (유저.스탯.장신구.등급 - 1))) {
                    알림창표시(`숙련도가 부족합니다`);
                    return;
                }

                const 응답 = await fetch("/rkrmf", {
                    method: "POST",
                    headers: { "Content-Type": "application/json" },
                    body: JSON.stringify({
                        액션: "장신구승급",
                        액션데이터: { 유저id: 유저.id }
                    })
                });

                const 결과 = await 응답.json();

                if (결과.성공) {
                    유저 = 결과.가글;
                    가글장비화면();
                    알림창표시(`${등급[유저.스탯.장신구.등급].이름}등급으로 승급 성공`);
                } else {
                    알림창표시(결과.오류);
                }

            } catch (error) {
                console.log(error);
            } finally {
                화면해제();
            }
        };

        객체생성(장신구승급과리롤, "장신구리롤", "여백", "버튼", "테두리", "");
        장신구리롤.innerHTML = `
        체력리롤<br>
        (등장범위${(유저.스탯.장신구.등급 - 0.5) * 1000}~${(유저.스탯.장신구.등급 + 0.5) * 1000})<br>
        비용 ${숫자한글(1000 * (3 ** (유저.스탯.장신구.등급 - 1)))}Gold
        `;

        장신구리롤.onclick = async () => {
            try {
                화면잠금();

                if (유저.스탯.현재골드 < 1000 * (3 ** (유저.스탯.장신구.등급 - 1))) {
                    알림창표시(`[${등급[유저.스탯.장신구.등급].이름}]의 리롤비용은 ${숫자한글(1000 * (3 ** (유저.스탯.장신구.등급 - 1)))}Gold입니다`);
                    return;
                }

                const 응답 = await fetch("/rkrmf", {
                    method: "POST",
                    headers: { "Content-Type": "application/json" },
                    body: JSON.stringify({
                        액션: "장신구리롤",
                        액션데이터: { 유저id: 유저.id }
                    })
                });

                const 결과 = await 응답.json();

                if (결과.성공) {
                    유저 = 결과.가글;
                    가글장비화면();
                    알림창표시("장신구 체력 리롤 성공");
                } else {
                    알림창표시(결과.오류);
                }

            } catch (error) {
                console.log(error);
            } finally {
                화면해제();
            }
        };




        객체생성(가글장비컨테이너, "날개컨테이너", "가로꽉", "테두리", "세로", "여백");

        객체생성(날개컨테이너, "날개모든기능", "", "가로꽉", "세로");

        객체생성(날개모든기능, "날개이름과속력", "양쪽", "", "", "밑줄");
        객체생성(날개이름과속력, "날개이름", "", "", "여백");
        날개이름.innerHTML = 유저.스탯.날개.이름 ? `[${등급[유저.스탯.날개.등급].이름}] ${유저.스탯.날개.이름}` : `[${등급[유저.스탯.날개.등급].이름}] ${유저.스탯.닉네임}의 날개`;
        날개이름.style.color = 색상맵[등급[유저.스탯.날개.등급].색상];

        날개이름.className = 클래스맵[유저.스탯.날개.등급] ?? "";

        객체생성(날개이름과속력, "날개속력", "", "", "여백");
        날개속력.innerHTML =
            `속력 +${유저.스탯.날개.속력} (` +
            `${Math.floor(
                (
                    (유저.스탯.날개.속력 - ((유저.스탯.날개.등급 - 0.5) * 10)) /
                    (((유저.스탯.날개.등급 + 0.5) * 10) - ((유저.스탯.날개.등급 - 0.5) * 10))
                ) * 100
            )}%)`;


        객체생성(날개모든기능, "날개승급과리롤", "", "", "양쪽", "");
        객체생성(날개승급과리롤, "날개승급", "여백", "버튼", "테두리", "");
        날개승급.innerHTML = `
        날개승급<br>
        (숙련도${숫자한글(1000 * (3 ** (유저.스탯.날개.등급 - 1)))})<br>
        `;

        날개승급.onclick = async () => {
            try {
                화면잠금();

                if (유저.스탯.날개.등급 > 8) {
                    알림창표시(`최고등급입니다`);
                    return;

                }
                if (유저.스탯.현재숙련도 < 1000 * (3 ** (유저.스탯.날개.등급 - 1))) {
                    알림창표시(`숙련도가 부족합니다`);
                    return;
                }

                const 응답 = await fetch("/rkrmf", {
                    method: "POST",
                    headers: { "Content-Type": "application/json" },
                    body: JSON.stringify({
                        액션: "날개승급",
                        액션데이터: { 유저id: 유저.id }
                    })
                });

                const 결과 = await 응답.json();

                if (결과.성공) {
                    유저 = 결과.가글;
                    가글장비화면();
                    알림창표시(`${등급[유저.스탯.날개.등급].이름}등급으로 승급 성공`);
                } else {
                    알림창표시(결과.오류);
                }

            } catch (error) {
                console.log(error);
            } finally {
                화면해제();
            }
        };

        객체생성(날개승급과리롤, "날개리롤", "여백", "버튼", "테두리", "");
        날개리롤.innerHTML = `
        속력리롤<br>
        (등장범위${(유저.스탯.날개.등급 - 0.5) * 10}~${(유저.스탯.날개.등급 + 0.5) * 10})<br>
        비용 ${숫자한글(1000 * (3 ** (유저.스탯.날개.등급 - 1)))}Gold
        `;

        날개리롤.onclick = async () => {
            try {
                화면잠금();

                if (유저.스탯.현재골드 < 1000 * (3 ** (유저.스탯.날개.등급 - 1))) {
                    알림창표시(`[${등급[유저.스탯.날개.등급].이름}]의 리롤비용은 ${숫자한글(1000 * (3 ** (유저.스탯.날개.등급 - 1)))}Gold입니다`);
                    return;
                }

                const 응답 = await fetch("/rkrmf", {
                    method: "POST",
                    headers: { "Content-Type": "application/json" },
                    body: JSON.stringify({
                        액션: "날개리롤",
                        액션데이터: { 유저id: 유저.id }
                    })
                });

                const 결과 = await 응답.json();

                if (결과.성공) {
                    유저 = 결과.가글;
                    가글장비화면();
                    알림창표시("날개 속력 리롤 성공");
                } else {
                    알림창표시(결과.오류);
                }

            } catch (error) {
                console.log(error);
            } finally {
                화면해제();
            }
        };



    } catch (error) {
        console.log(error);
    } finally {
        화면해제();
    }
}

가글장비.onclick = async () => {
    try {
        if (가글장비컨테이너.style.display === "none") {
            가글장비화면();
        }
    } catch (error) {
        console.log(error);
    } finally {
        화면해제();
    }
};

객체생성(document.body, "가글일어난일컨테이너", "사백", "테두리", "세로", "내부", "숨기기");

//가글일어난일화면함수
async function 가글일어난일화면() {
    try {
        화면잠금(``);
        가글화면전환(가글일어난일컨테이너);

        가글일어난일컨테이너.innerHTML = ``;

        객체생성(가글일어난일컨테이너, "가글일어난일설명", "가로꽉", "밑줄", "여백");
        가글일어난일설명.innerHTML = `최근에 일어난 일들입니다`;

        try {
            화면잠금();

            const 응답 = await fetch("/rkrmf", {
                method: "POST",
                headers: { "Content-Type": "application/json" },
                body: JSON.stringify({
                    액션: "가글일어난일",
                    액션데이터: {}
                })
            });

            const 결과 = await 응답.json();

            if (결과.성공) {

                결과.가글일어난일.sort((a, b) => b.id - a.id);

                // 이후 for in 사용
                window.몇번 = 0;
                for (const i in 결과.가글일어난일) {
                    몇번++;
                    const 행 = 결과.가글일어난일[i];

                    객체생성(가글일어난일컨테이너, `${i}일어난일`, "", "", "여백");
                    window[`${i}일어난일`].innerHTML = `${행.스탯}`;

                }
                if (!몇번) {
                    객체생성(가글일어난일컨테이너, `일어난일몇번`, "가로꽉", "테두리", "여백");
                    일어난일몇번.innerHTML = `아무일도 일어나지 않았습니다`;
                }
            } else {
                알림창표시(결과.오류);
            }

        } catch (error) {
            console.log(error);
        } finally {
            화면해제();
        }


    } catch (error) {
        console.log(error);
    } finally {
        화면해제();
    }
}

가글일어난일.onclick = async () => {
    try {
        if (가글일어난일컨테이너.style.display === "none") {
            가글일어난일화면();
        }
    } catch (error) {
        console.log(error);
    } finally {
        화면해제();
    }
};

객체생성(document.body, "가글전당컨테이너", "사백", "테두리", "세로", "내부", "숨기기");

//가글전당화면함수
async function 가글전당화면() {
    try {
        화면잠금(``);
        가글화면전환(가글전당컨테이너);

        가글전당컨테이너.innerHTML = ``;

        객체생성(가글전당컨테이너, "가글전당설명", "가로꽉", "밑줄", "여백");
        가글전당설명.innerHTML = `유저의 행을 클릭 시 미니정보창을 볼 수 있습니다`;

        try {
            화면잠금();

            const 응답 = await fetch("/rkrmf", {
                method: "POST",
                headers: { "Content-Type": "application/json" },
                body: JSON.stringify({
                    액션: "가글전당",
                    액션데이터: { 유저id: 유저.id }
                })
            });

            const 결과 = await 응답.json();

            if (결과.성공) {

                결과.가글전당 = 결과.가글전당
                    .filter(v => v.스탯.전투력)
                    .sort((a, b) => b.스탯.전투력 - a.스탯.전투력);
                결과.가글서브.sort((a, b) => b.스탯.마신.방어 - a.스탯.마신.방어);

                const 서브맵 = {};
                for (const s of 결과.가글서브) {
                    서브맵[s.스탯.닉네임] = s.스탯;
                }

                for (const i in 결과.가글전당) {
                    const 유저들 = 결과.가글전당[i].스탯;
                    const 유저서브 = 서브맵[유저들.닉네임];

                    객체생성(가글전당컨테이너, `${i}전당정보`, "양쪽", "밑줄", "버튼");

                    객체생성(window[`${i}전당정보`], `${i}전당순위`, "왼쪽", "플렉스일", "여백", "버튼");
                    window[`${i}전당순위`].innerHTML = `${(+i) + 1}위`;

                    객체생성(window[`${i}전당정보`], `${i}전당전투력`, "버튼", "플렉스일", "여백");
                    window[`${i}전당전투력`].innerHTML = `전투력 ${숫자한글(결과.가글전당[i].스탯.전투력)}`;

                    객체생성(window[`${i}전당정보`], `${i}전당닉넴`, "오른쪽", "플렉스일", "여백", "버튼");
                    window[`${i}전당닉넴`].innerHTML = `${결과.가글전당[i].스탯.닉네임}`;


                    if (결과.가글전당[i].스탯.닉네임 === 마신방어1위?.스탯.닉네임) {
                        window[`${i}전당닉넴`].className = `마법의팔레트1위`;

                    } else if (결과.가글전당[i].스탯.닉네임 === 마신방어2위?.스탯.닉네임) {
                        window[`${i}전당닉넴`].className = `마법의팔레트2위`;

                    } else if (결과.가글전당[i].스탯.닉네임 === 마신방어3위?.스탯.닉네임) {
                        window[`${i}전당닉넴`].className = `마법의팔레트3위`;

                    }

                    if (결과.가글전당[i].스탯.주인장) {
                        window[`${i}전당닉넴`].className = `마법의팔레트주인장`;

                    }

                    //수정중
                    window[`${i}전당정보`].onclick = async (e) => {
                        e.stopPropagation();
                        try {
                            const 유저들 = 결과.가글전당[i].스탯;

                            if (미니정보창컨테이너.style.display === `flex`) {
                                미니정보창컨테이너.style.display = `none`;
                                return;
                            }
                            미니정보창컨테이너.style.display = `flex`;
                            미니정보창컨테이너.innerHTML = ``;

                            객체생성(미니정보창컨테이너, `미니일행`, ``, ``, ``);
                            객체생성(미니일행, `미니레벨`, ``, ``, `여백`);
                            미니레벨.innerHTML = `Lv. ${유저들.레벨}`;
                            객체생성(미니일행, `미니닉넴`, ``, ``, `여백`);
                            미니닉넴.innerHTML = 유저들.닉네임;
                            // 객체생성(미니일행, `미니전투력`, ``, ``, `여백`);
                            // 미니전투력.innerHTML = `전투력 ${숫자한글(유저들.전투력)}`;


                            객체생성(미니정보창컨테이너, `미니이행`, `세로`, `가로꽉`, ``);
                            // 객체생성(미니이행, `미니장비`, ``, ``, `여백`);
                            // 미니장비.innerHTML = `장비`;
                            객체생성(미니이행, `미니장비모음일`, ``, ``, ``);
                            객체생성(미니장비모음일, `미니장비모음일좌`, ``, ``, `여백`);
                            객체생성(미니장비모음일, `미니장비모음일우`, ``, ``, `여백`);

                            미니장비모음일좌.innerHTML = `무기`;
                            미니장비모음일우.innerHTML = `[${등급[유저들.무기.등급].이름}] ${유저들.무기.이름 ? 유저들.무기.이름 : `${유저들.닉네임}의 무기`} +${유저들.무기.공격력}`;
                            미니장비모음일우.style.color = 색상맵[등급[유저들.무기.등급].색상];

                            객체생성(미니이행, `미니장비모음이`, ``, ``, ``);
                            객체생성(미니장비모음이, `미니장비모음이좌`, ``, ``, `여백`);
                            객체생성(미니장비모음이, `미니장비모음이우`, ``, ``, `여백`);

                            미니장비모음이좌.innerHTML = `방어구`;
                            미니장비모음이우.innerHTML = `[${등급[유저들.방어구.등급].이름}] ${유저들.방어구.이름 ? 유저들.방어구.이름 : `${유저들.닉네임}의 방어구`} +${유저들.방어구.방어력}`;
                            미니장비모음이우.style.color = 색상맵[등급[유저들.방어구.등급].색상];

                            객체생성(미니이행, `미니장비모음삼`, ``, ``, ``);
                            객체생성(미니장비모음삼, `미니장비모음삼좌`, ``, ``, `여백`);
                            객체생성(미니장비모음삼, `미니장비모음삼우`, ``, ``, `여백`);

                            미니장비모음삼좌.innerHTML = `장신구`;
                            미니장비모음삼우.innerHTML = `[${등급[유저들.장신구.등급].이름}] ${유저들.장신구.이름 ? 유저들.장신구.이름 : `${유저들.닉네임}의 장신구`} +${유저들.장신구.체력}`;
                            미니장비모음삼우.style.color = 색상맵[등급[유저들.장신구.등급].색상];


                            객체생성(미니이행, `미니장비모음사`, ``, ``, ``);
                            객체생성(미니장비모음사, `미니장비모음사좌`, ``, ``, `여백`);
                            객체생성(미니장비모음사, `미니장비모음사우`, ``, ``, `여백`);

                            미니장비모음사좌.innerHTML = `날개`;
                            미니장비모음사우.innerHTML = `[${등급[유저들.날개.등급].이름}] ${유저들.날개.이름 ? 유저들.날개.이름 : `${유저들.닉네임}의 날개`} +${유저들.날개.속력}`;
                            미니장비모음사우.style.color = 색상맵[등급[유저들.날개.등급].색상];


                            객체생성(미니정보창컨테이너, `미니삼행`, `양쪽`, ``, `밑줄`);
                            객체생성(미니삼행, `미니삼행일`, ``, `여백`, `플렉스일`);
                            미니삼행일.innerHTML = `공격력보너스<br>+${(Object.entries(유저들.유물).reduce((합, [등급, 값]) => 합 + ((값[0] || 0) * 삼배수[등급]), 0).toFixed(2))}%`;

                            객체생성(미니삼행, `미니삼행이`, ``, `여백`, `플렉스일`);
                            미니삼행이.innerHTML = `방어력보너스<br>+${(Object.entries(유저들.유물).reduce((합, [등급, 값]) => 합 + ((값[1] || 0) * 삼배수[등급]), 0).toFixed(2))}%`;
                            객체생성(미니삼행, `미니삼행삼`, ``, `여백`, `플렉스일`);
                            미니삼행삼.innerHTML = `체력보너스<br>+${(Object.entries(유저들.유물).reduce((합, [등급, 값]) => 합 + ((값[2] || 0) * 삼배수[등급]), 0).toFixed(2))}%`;



                            객체생성(미니정보창컨테이너, `미니사행`, `양쪽`, ``, ``);
                            객체생성(미니사행, `미니사행좌`, `플렉스일`, `세로`, ``);
                            미니사행좌.style.borderRight = `1px solid ${색상맵[`중흰`]}`;
                            미니사행좌.style.borderRadius = ``;
                            객체생성(미니사행, `미니사행우`, ``, `플렉스일`, `세로`);



                            객체생성(미니사행좌, `미니생성일`, ``, ``, `양쪽`);
                            객체생성(미니생성일, `미니생성일좌`, ``, ``, `여백`);
                            미니생성일좌.innerHTML = `등장`;
                            객체생성(미니생성일, `미니생성일우`, ``, ``, `여백`);
                            미니생성일우.innerHTML = `${유저들.생성년}`;


                            객체생성(미니사행좌, `미니스태미너`, ``, ``, `양쪽`);
                            객체생성(미니스태미너, `미니스태미너좌`, ``, ``, `여백`);
                            미니스태미너좌.innerHTML = `총스태미너`;
                            객체생성(미니스태미너, `미니스태미너우`, ``, ``, `여백`);
                            미니스태미너우.innerHTML = `${숫자한글(유저들.총스태미너)}`;


                            객체생성(미니사행좌, `미니골드`, ``, ``, `양쪽`);
                            객체생성(미니골드, `미니골드좌`, ``, ``, `여백`);
                            미니골드좌.innerHTML = `총골드`;
                            객체생성(미니골드, `미니골드우`, ``, ``, `여백`);
                            미니골드우.innerHTML = `${숫자한글(유저들.총골드)}`;


                            객체생성(미니사행좌, `미니숙련도`, ``, ``, `양쪽`);
                            객체생성(미니숙련도, `미니숙련도좌`, ``, ``, `여백`);
                            미니숙련도좌.innerHTML = `총숙련도`;
                            객체생성(미니숙련도, `미니숙련도우`, ``, ``, `여백`);
                            미니숙련도우.innerHTML = `${숫자한글(유저들.총숙련도)}`;





                            객체생성(미니사행우, `미니오른넷`, ``, ``, `양쪽`);
                            객체생성(미니오른넷, `미니오른넷좌`, ``, ``, `여백`);
                            미니오른넷좌.innerHTML = `접속`;
                            객체생성(미니오른넷, `미니오른넷우`, ``, ``, `여백`);
                            미니오른넷우.innerHTML = `${유저들.n일차}일차`;


                            객체생성(미니사행우, `미니오른둘`, ``, ``, `양쪽`);
                            객체생성(미니오른둘, `미니오른둘좌`, ``, ``, `여백`);
                            미니오른둘좌.innerHTML = `전적`;
                            객체생성(미니오른둘, `미니오른둘우`, ``, ``, `여백`);
                            미니오른둘우.innerHTML = `${유저들.악마승리 ?? `-`}승/${유저들.악마패배 ?? `-`}패`;

                            객체생성(미니사행우, `미니마신방어`, ``, ``, `양쪽`);
                            객체생성(미니마신방어, `미니마신방어좌`, ``, ``, `여백`);
                            미니마신방어좌.innerHTML = `마신방어`;
                            객체생성(미니마신방어, `미니마신방어우`, ``, ``, `여백`);
                            미니마신방어우.innerHTML = `${유저서브.마신.방어}회`;

                            객체생성(미니사행우, `미니오른셋`, ``, ``, `양쪽`);
                            객체생성(미니오른셋, `미니오른셋좌`, ``, ``, `여백`);
                            미니오른셋좌.innerHTML = `마신숭배`;
                            객체생성(미니오른셋, `미니오른셋우`, ``, ``, `여백`);
                            미니오른셋우.innerHTML = `${유저서브.마신.숭배}회`;




                        } catch (error) {
                            console.log(error);
                        } finally {
                        }
                    };

                    if (결과.가글전당[i].스탯.닉네임 === 유저.스탯.닉네임) {
                        window[`${i}전당정보`].style.border = `1px solid ${색상맵[`중파`]}`;
                    }
                }

            } else {
                알림창표시(결과.오류);
            }

        } catch (error) {
            console.log(error);
        } finally {
            화면해제();
        }


    } catch (error) {
        console.log(error);
    } finally {
        화면해제();
    }
}

가글전당.onclick = async () => {
    try {
        if (가글전당컨테이너.style.display === "none") {
            가글전당화면();
        }
    } catch (error) {
        console.log(error);
    } finally {
        화면해제();
    }
};

객체생성(document.body, "가글유물컨테이너", "사백", "테두리", "세로", "내부", "숨기기");

//가글유물화면함수
async function 가글유물화면() {
    try {
        화면잠금(``);
        가글화면전환(가글유물컨테이너);

        가글유물컨테이너.innerHTML = ``;

        객체생성(가글유물컨테이너, "가글유물설명", "가로꽉", "밑줄", "여백");
        가글유물설명.innerHTML = `
        드랍된 유물은 공 방 체 중 랜덤한 스탯값을 상승시켜줍니다<br>
        `;

        // 객체생성(가글유물컨테이너, `보유유물총량`, "", "", "", "여백");
        // 보유유물총량.innerHTML = `유물총량<br>일반:${유저.스탯.유물총량[1]} 레어:${유저.스탯.유물총량[2]} 신화:${유저.스탯.유물총량[3]} 고대:${유저.스탯.유물총량[4]} 태초:${유저.스탯.유물총량[5]}<br>타락:${유저.스탯.유물총량[6]} 진화:${유저.스탯.유물총량[7]} 멸망:${유저.스탯.유물총량[8]} 공허:${유저.스탯.유물총량[9]} `;
        // 객체생성(가글유물컨테이너, `유물초기화`, "버튼", "테두리", "", "여백");
        // 유물초기화.innerHTML = `유물초기화`;
        // 유물초기화.onclick = async () => {
        //     try {
        //         화면잠금(`유물을 초기화중입니다`);

        //         if (!유저.스탯.현재스태미너) {
        //             알림창표시("스태미너가 부족합니다");
        //             return;
        //         }

        //         if (Object.values(유저.스탯.유물총량).reduce((a, b) => a + b, 0) === 0) {
        //             알림창표시(`회수할 유물이 없습니다`);
        //             return;
        //         }

        //         if (Object.values(유저.스탯.유물총량).reduce((a, b) => a + b, 0) === Object.values(유저.스탯.유물).reduce((a, b) => a + b, 0)) {
        //             알림창표시(`회수할 유물이 없습니다`);
        //             return;
        //         }

        //         const 응답 = await fetch("/rkrmf", {
        //             method: "POST",
        //             headers: { "Content-Type": "application/json" },
        //             body: JSON.stringify({
        //                 액션: "유물초기화",
        //                 액션데이터: { 유저id: 유저.id, }
        //             })
        //         });

        //         const 결과 = await 응답.json();

        //         if (결과.성공) {

        //             유저 = 결과.가글;

        //             가글유물화면();

        //             알림창표시("유물을 초기화했습니다");

        //         } else {
        //             알림창표시(결과.오류);
        //         }

        //     } catch (error) {
        //         console.log(error);
        //     } finally {
        //         화면해제();
        //     }
        // };

        객체생성(가글유물컨테이너, `보너스스탯`, "", "", "가로꽉", "밑줄");
        객체생성(보너스스탯, `유물공보너스`, "", "", "플렉스일", "여백");
        유물공보너스.innerHTML = `공격력보너스<br>+${(Object.entries(유저.스탯.유물).reduce((합, [등급, 값]) => 합 + ((값[0] || 0) * 삼배수[등급]), 0)).toFixed(2)}%`;
        객체생성(보너스스탯, `유물방보너스`, "", "", "플렉스일", "여백");
        유물방보너스.innerHTML = `방어력보너스<br>+${(Object.entries(유저.스탯.유물).reduce((합, [등급, 값]) => 합 + ((값[1] || 0) * 삼배수[등급]), 0)).toFixed(2)}%`;
        객체생성(보너스스탯, `유물체보너스`, "", "", "플렉스일", "여백");
        유물체보너스.innerHTML = `체력보너스<br>+${(Object.entries(유저.스탯.유물).reduce((합, [등급, 값]) => 합 + ((값[2] || 0) * 삼배수[등급]), 0)).toFixed(2)}%`;


        const 모든유물 = 유저.스탯.유물;
        let 유물보유유무 = 0;
        for (const i in 유저.스탯.유물총량) {

            if (유저.스탯.유물총량[i]) {
                유물보유유무++;
                객체생성(가글유물컨테이너, `${i}유물모음`, "테두리", "세로", "가로꽉", "여백");
                객체생성(window[`${i}유물모음`], `${i}유물첫줄`, "양쪽", "밑줄", "");
                객체생성(window[`${i}유물첫줄`], `${i}유물이름`, "", "", "여백");
                window[`${i}유물이름`].innerHTML = `[${등급[i].이름}] ${유물모음[i].이름} × ${유저.스탯.유물총량[i]}`;
                window[`${i}유물이름`].style.color = 색상맵[등급[i].색상];

                객체생성(window[`${i}유물첫줄`], `${i}유물효과`, "", "", "여백");
                window[`${i}유물효과`].innerHTML = `${유물모음[i].설명}`;


                객체생성(window[`${i}유물모음`], `${i}유물둣줄`, "양쪽", "", "");
                객체생성(window[`${i}유물둣줄`], `${i}유물공`, "", "", "여백");
                window[`${i}유물공`].innerHTML = `공(${모든유물[i][0]}) +${(모든유물[i][0] * 삼배수[i]).toFixed(2)}%`;
                객체생성(window[`${i}유물둣줄`], `${i}유물방`, "", "", "여백");
                window[`${i}유물방`].innerHTML =
                    `방(${모든유물[i][1]}) +${(모든유물[i][1] * 삼배수[i]).toFixed(2)}%`;
                객체생성(window[`${i}유물둣줄`], `${i}유물체`, "", "", "여백");
                window[`${i}유물체`].innerHTML = `체(${모든유물[i][2]}) +${(모든유물[i][2] * 삼배수[i]).toFixed(2)}%`;



            }
        }
        if (!유물보유유무) {
            객체생성(가글유물컨테이너, `유물없음`, "테두리", "세로", "가로꽉", "여백");
            유물없음.innerHTML = `유물이 없습니다`;

        }

    } catch (error) {
        console.log(error);
    } finally {
        화면해제();
    }
}

가글유물.onclick = async () => {
    try {
        if (가글유물컨테이너.style.display === "none") {
            가글유물화면();
        }
    } catch (error) {
        console.log(error);
    } finally {
        화면해제();
    }
};

객체생성(document.body, "가글스킬컨테이너", "사백", "테두리", "세로", "내부", "숨기기");

//가글스킬화면함수
async function 가글스킬화면() {
    try {
        화면잠금(``);
        가글화면전환(가글스킬컨테이너);

        가글스킬컨테이너.innerHTML = ``;

        객체생성(가글스킬컨테이너, "가글스킬설명", "가로꽉", "밑줄", "여백");
        가글스킬설명.innerHTML = `
        레벨당 스킬포인트 1개가 지급됩니다<br>
        스킬당 최대레벨은 19레벨입니다<br>
        초기화 & 포인트회수 행동에는 모두 스태미너(1)가 소모됩니다<br>
        "등반하실 땐 도약스킬 회수를 추천드립니다"<br>
        `;


        객체생성(가글스킬컨테이너, "스킬포인트초기화", "양쪽", "밑줄", "");
        객체생성(스킬포인트초기화, "남은스포", "", "", "여백");
        남은스포.innerHTML = `스킬포인트 : ${유저.스탯.스킬포인트}`;

        객체생성(스킬포인트초기화, "스킬초기화", "테두리", "버튼", "여백");
        스킬초기화.innerHTML = `스킬초기화`;


        스킬초기화.onclick = async () => {
            //총합
            if (Object.values(유저.스탯.스킬[유저.스탯.프리셋]).reduce((a, b) => a + b, 0) === 0) {
                알림창표시(`회수할 스킬이 없습니다`);
                return;
            }

            if (!유저.스탯.현재스태미너) {
                알림창표시("스태미너가 부족합니다");
                return;
            }

            try {
                화면잠금();

                const 응답 = await fetch("/rkrmf", {
                    method: "POST",
                    headers: { "Content-Type": "application/json" },
                    body: JSON.stringify({
                        액션: "스킬초기화",
                        액션데이터: { 유저id: 유저.id }
                    })
                });

                const 결과 = await 응답.json();

                if (결과.성공) {

                    유저 = 결과.가글;

                    가글스킬화면();

                    알림창표시("모든스킬이 초기화되었습니다");

                } else {
                    알림창표시(결과.오류);
                }

            } catch (error) {
                console.log(error);
            } finally {
                화면해제();
            }
        };



        객체생성(가글스킬컨테이너, "스킬박스", "", "세로", "가로꽉");

        for (const i in 스킬모음) {
            const 스킬레벨 = 유저.스탯.스킬[유저.스탯.프리셋][i];
            객체생성(스킬박스, `${i}스킬박스`, "테두리", "세로", "가로꽉", "여백");

            객체생성(window[`${i}스킬박스`], `${i}스킬이름과투자`, "", "양쪽", "밑줄");
            객체생성(window[`${i}스킬이름과투자`], `${i}스킬이름`, "", "", "여백");

            window[`${i}스킬이름`].innerHTML = `[${등급[유저.스탯.스킬등급[i] ?? ""].이름}] ${스킬모음[i].이름} +${스킬레벨}`;

            객체생성(window[`${i}스킬이름과투자`], `${i}스킬투자모음`, "", "", "");
            객체생성(window[`${i}스킬투자모음`], `${i}전체회수`, "버튼", "테두리", "여백");
            window[`${i}전체회수`].innerHTML = `X`;
            객체생성(window[`${i}스킬투자모음`], `${i}일회회수`, "버튼", "테두리", "여백");
            window[`${i}일회회수`].innerHTML = `-`;
            객체생성(window[`${i}스킬투자모음`], `${i}일회투자`, "버튼", "테두리", "여백");
            window[`${i}일회투자`].innerHTML = `+`;
            객체생성(window[`${i}스킬투자모음`], `${i}전체투자`, "버튼", "테두리", "여백");
            window[`${i}전체투자`].innerHTML = `M`;


            window[`${i}스킬투자모음`].onclick = async (e) => {
                const id = e.target.id;
                if (!id) return;

                if (!id.endsWith("전체회수") &&
                    !id.endsWith("일회회수") &&
                    !id.endsWith("일회투자") &&
                    !id.endsWith("전체투자")) return;

                const 스킬번호 = id.match(/^\d+/)[0];
                const 타입 = id.replace(스킬번호, "");

                스킬투자요청(스킬번호, 타입);
            };

            async function 스킬투자요청(스킬번호, 타입) {
                try {
                    화면잠금();

                    if ((타입 === "일회회수" || 타입 === "전체회수") && 유저.스탯.스킬[유저.스탯.프리셋][+스킬번호] === 0) {
                        알림창표시(`회수할 포인트가 없습니다`);
                        return;
                    }

                    if (타입 === "일회회수" || 타입 === "전체회수") {
                        if (!유저.스탯.현재스태미너) {
                            알림창표시("스태미너가 부족합니다");
                            return;
                        }
                    }

                    if ((타입 === "일회투자" || 타입 === "전체투자") && 유저.스탯.스킬[유저.스탯.프리셋][+스킬번호] === 19) {
                        알림창표시(`최대레벨입니다`);
                        return;
                    }

                    if ((타입 === "일회투자" || 타입 === "전체투자") && 유저.스탯.스킬포인트 < 1) {
                        알림창표시(`스킬포인트가 부족합니다`);
                        return;
                    }

                    const 응답 = await fetch("/rkrmf", {
                        method: "POST",
                        headers: { "Content-Type": "application/json" },
                        body: JSON.stringify({
                            액션: "스킬투자",
                            액션데이터: { 유저id: 유저.id, 스킬번호: +스킬번호, 타입 }
                        })
                    });

                    const 결과 = await 응답.json();

                    if (결과.성공) {

                        유저 = 결과.가글;

                        가글스킬화면();

                        알림창표시(`${타입} 되었습니다`);

                    } else {
                        알림창표시(결과.오류);
                    }

                } catch (error) {
                    console.log(error);
                } finally {
                    화면해제();
                }
            }


            객체생성(window[`${i}스킬박스`], `${i}스킬설명`, "오른쪽", "", "여백");
            window[`${i}스킬설명`].innerHTML = 스킬모음[i].설명(스킬레벨);

        }




    } catch (error) {
        console.log(error);
    } finally {
        화면해제();
    }
}

가글스킬.onclick = async () => {
    try {
        if (가글스킬컨테이너.style.display === "none") {
            가글스킬화면();
        }
    } catch (error) {
        console.log(error);
    } finally {
        화면해제();
    }
};

객체생성(document.body, "가글마신전컨테이너", "사백", "테두리", "세로", "내부", "숨기기");

//가글마신전화면함수
async function 가글마신전화면() {
    try {
        화면잠금(`경비병들을 가로지르는 중입니다`);
        가글화면전환(가글마신전컨테이너);

        가글마신전컨테이너.innerHTML = ``;

        객체생성(가글마신전컨테이너, "가글마신전설명", "가로꽉", "밑줄", "여백");
        가글마신전설명.innerHTML = `
        스태미너(1)를 소모하여 마신에게 도전 또는 숭배할 수 있습니다<br>
        방어 순위에 따라 닉네임에 마법의팔레트 효과가 적용됩니다<br>
        
        `;

        try {
            const 응답 = await fetch("/rkrmf", {
                method: "POST",
                headers: { "Content-Type": "application/json" },
                body: JSON.stringify({
                    액션: "가글마신전",
                    액션데이터: { 유저id: 유저.id }
                })
            });

            const 결과 = await 응답.json();

            if (결과.성공) {
                알림창표시(`마신전에 입장했습니다`);



                window.마신 = 결과.마신;
                window.마신서브 = 결과.마신서브;

                객체생성(가글마신전컨테이너, "마신정보", "가로꽉", "세로", "");

                객체생성(마신정보, "마신타이틀", "크게", "진하게", "여백");
                마신타이틀.innerHTML = `마신`;
                객체생성(마신정보, "마신방어이름숭배", "", "양쪽", "여백", "");
                객체생성(마신방어이름숭배, "마신방어", "", "", "여백", "플렉스일", "왼쪽");
                마신방어.innerHTML = `방어 : ${마신서브.마신.방어}`;
                객체생성(마신방어이름숭배, "마신이름", "크게", "밑줄", "여백", "진하게", "플렉스일");
                마신이름.innerHTML = `${마신.닉네임}`;
                마신이름.className = `마법의팔레트마신`;
                마신이름.style.flex = `2`;
                객체생성(마신방어이름숭배, "마신숭배", "", "", "여백", "플렉스일", "오른쪽");
                마신숭배.innerHTML = `숭배 : ${마신서브.마신.숭배}`;


                객체생성(마신정보, "스탯모음박스", "테두리", "세로", "가로꽉", "여백");

                const 스탯모음 = {
                    0: { 0: { 0: "레벨", 1: 숫자한글(마신.레벨) }, 1: { 0: "최종공격력", 1: 숫자한글(마신.최종공격력) } },
                    1: { 0: { 0: "최종방어력", 1: 숫자한글(마신.최종방어력) }, 1: { 0: "최종체력", 1: 숫자한글(마신.최종체력) } },
                    2: { 0: { 0: "최종속력", 1: 숫자한글(마신.최종속력) }, 1: { 0: "전투력", 1: 숫자한글(마신.전투력) } },
                };

                for (const a in 스탯모음) {
                    객체생성(스탯모음박스, `스탯모음${a}행`, "", "양쪽", "", "");
                    for (const b in 스탯모음[a]) {
                        객체생성(window[`스탯모음${a}행`], `스탯모음${a}행${b}열`, "플렉스일", "양쪽", "밑줄", "여백");
                        window[`스탯모음${a}행${b}열`].innerHTML = `<span>${스탯모음[a][b][0]}</span><span>${스탯모음[a][b][1]}</span>`;
                    }
                }


                객체생성(마신정보, "장비모음박스", "테두리", "세로", "가로꽉", "여백");

                const 장비모음 = {
                    0: { 0: "무기", 1: `${등급[마신.무기.등급].이름}`, 2: `${마신.무기.이름 ? 마신.무기.이름 : `${마신.닉네임}의 무기`}`, 3: 마신.무기.공격력 },
                    1: { 0: "방어구", 1: `${등급[마신.방어구.등급].이름}`, 2: `${마신.방어구.이름 ? 마신.방어구.이름 : `${마신.닉네임}의 방어구`}`, 3: 마신.방어구.방어력 },
                    2: { 0: "장신구", 1: `${등급[마신.장신구.등급].이름}`, 2: `${마신.장신구.이름 ? 마신.장신구.이름 : `${마신.닉네임}의 장신구`}`, 3: 마신.장신구.체력 },
                    3: { 0: "날개", 1: `${등급[마신.날개.등급].이름}`, 2: `${마신.날개.이름 ? 마신.날개.이름 : `${마신.닉네임}의 날개`}`, 3: 마신.날개.속력 },
                };

                for (const a in 장비모음) {
                    객체생성(장비모음박스, `장비모음${a}행`, "플렉스일", "양쪽", "밑줄", "여백");
                    window[`장비모음${a}행`].innerHTML = `
                    <span>${장비모음[a][0]}</span>
                    <span style="color:${색상맵[등급[마신[장비모음[a][0]].등급].색상]}">[${장비모음[a][1]}] ${장비모음[a][2]} +${장비모음[a][3]}</span>
                    `;

                }


                객체생성(마신정보, `스킬모음박스`, "여백", "테두리", "세로", "가로꽉");
                객체생성(스킬모음박스, `스킬모음일행`, "", "양쪽", "", "");
                객체생성(스킬모음박스, `스킬모음이행`, "", "양쪽", "", "");
                for (const a in 스킬모음) {
                    if (a < 6) {
                        객체생성(스킬모음일행, `${a} 스킬`, "", "", "밑줄", "여백");
                        window[`${a} 스킬`].innerHTML = `${스킬모음[a].이름} +${마신.스킬[마신.프리셋][a]} `;

                    } else {
                        객체생성(스킬모음이행, `${a} 스킬`, "", "", "밑줄", "여백");
                        window[`${a} 스킬`].innerHTML = `${스킬모음[a].이름} +${마신.스킬[마신.프리셋][a] ?? `0`} `;

                    }

                }


                객체생성(마신정보, "마신도전숭배", "", "", "여백");
                객체생성(마신도전숭배, "마신도전", "버튼", "테두리", "여백");
                마신도전.innerHTML = `도전`;
                객체생성(마신도전숭배, "마신숭배하기", "버튼", "테두리", "여백");
                마신숭배하기.innerHTML = `숭배`;

                마신숭배하기.onclick = async () => {
                    try {
                        화면잠금();

                        if (마신.닉네임 === 유저.스탯.닉네임) {
                            알림창표시(`마신은 그저 지켜볼 뿐입니다`);
                            return;
                        }

                        if (유저.스탯.레벨 < 9) {
                            알림창표시(`9레벨부터 가능합니다`);
                            return;
                        }

                        if (유저.스탯.현재스태미너 < 1) {
                            알림창표시(`스태미너가 부족합니다`);
                            return;
                        }

                        const 응답 = await fetch("/rkrmf", {
                            method: "POST",
                            headers: { "Content-Type": "application/json" },
                            body: JSON.stringify({
                                액션: "마신숭배",
                                액션데이터: { 유저id: 유저.id }
                            })
                        });

                        const 결과 = await 응답.json();

                        if (결과.성공) {

                            유저 = 결과.가글;

                            가글마신전화면();

                        } else {
                            알림창표시(결과.오류);
                        }

                    } catch (error) {
                        console.log(error);
                    } finally {
                        화면해제();
                    }
                };

                마신도전.onclick = async () => {
                    try {
                        화면잠금();

                        if (마신.닉네임 === 유저.스탯.닉네임) {
                            알림창표시(`마신은 그저 지켜볼 뿐입니다`);
                            return;
                        }

                        if (유저.스탯.레벨 < 9) {
                            알림창표시(`9레벨부터 가능합니다`);
                            return;
                        }

                        if (유저.스탯.현재스태미너 < 1) {
                            알림창표시(`스태미너가 부족합니다`);
                            return;
                        }

                        const 응답 = await fetch("/rkrmf", {
                            method: "POST",
                            headers: { "Content-Type": "application/json" },
                            body: JSON.stringify({
                                액션: "마신도전",
                                액션데이터: { 유저id: 유저.id }
                            })
                        });

                        const 결과 = await 응답.json();

                        if (결과.성공) {

                            유저 = 결과.가글;

                            await 가글마신전화면();

                            객체생성(마신정보, `마신전승패`, "", "", "", "여백");
                            마신전승패.innerHTML = 결과.전투결과.승패 ? "승리" : "패배";

                            for (const i in 결과.전투결과.전투로그) {
                                객체생성(마신정보, `${i}마신턴로그`, "세로", "사백", "테두리", "여백");
                                객체생성(window[`${i}마신턴로그`], `${i}마신턴`, "", "가로꽉", "밑줄", "여백");
                                window[`${i}마신턴`].innerHTML = `${i} Turn`;

                                for (const j in 결과.전투결과.전투로그[i]) {
                                    if (결과.전투결과.전투로그[i][j].주체) {
                                        객체생성(window[`${i}마신턴로그`], `${i}마신${j} 로그`, "", "가로꽉", "왼쪽", "여백");
                                        window[`${i}마신${j} 로그`].style.color = 색상맵[`중파`];


                                        const 로그 = 결과.전투결과.전투로그[i][j];

                                        let 접두어 = "";

                                        if (로그.스킬.includes(1)) 접두어 += "[치명]";
                                        if (로그.스킬.includes(2)) 접두어 += "[기절]";
                                        if (로그.스킬.includes(3)) 접두어 += "[반격]";
                                        if (로그.스킬.includes(4)) 접두어 += "[회복]";
                                        if (로그.스킬.includes(5)) 접두어 += "[과열]";
                                        if (로그.스킬.includes(6)) 접두어 += "[분쇄]";
                                        if (로그.스킬.includes(7)) 접두어 += "[처형]";
                                        if (로그.스킬.includes(8)) 접두어 += "[조준]";
                                        if (로그.스킬.includes(9)) 접두어 += "[쇠약]";

                                        window[`${i}마신${j} 로그`].innerHTML =
                                            `${접두어} ${로그.피해.toLocaleString()} `;


                                    } else {
                                        객체생성(window[`${i}마신턴로그`], `${i}마신${j} 로그`, "", "가로꽉", "오른쪽", "여백");
                                        window[`${i}마신${j} 로그`].style.color = 색상맵[`중빨`];


                                        const 로그 = 결과.전투결과.전투로그[i][j];

                                        let 접두어 = "";

                                        if (로그.스킬.includes(1)) 접두어 += "[치명]";
                                        if (로그.스킬.includes(2)) 접두어 += "[기절]";
                                        if (로그.스킬.includes(3)) 접두어 += "[반격]";
                                        if (로그.스킬.includes(4)) 접두어 += "[회복]";
                                        if (로그.스킬.includes(5)) 접두어 += "[과열]";
                                        if (로그.스킬.includes(6)) 접두어 += "[분쇄]";
                                        if (로그.스킬.includes(7)) 접두어 += "[처형]";
                                        if (로그.스킬.includes(8)) 접두어 += "[조준]";
                                        if (로그.스킬.includes(9)) 접두어 += "[쇠약]";

                                        window[`${i}마신${j} 로그`].innerHTML =
                                            `${접두어} ${로그.피해.toLocaleString()} `;

                                    }

                                    if (Number(j) === 결과.전투결과.전투로그[i].length - 1) {
                                        객체생성(window[`${i}마신턴로그`], `${i}마신내정보상대정보`, "", "양쪽", "", "");

                                        객체생성(window[`${i}마신내정보상대정보`], `${i}마신내정보`, "플렉스일", "테두리", "세로", "여백");
                                        객체생성(window[`${i}마신내정보`], `${i}마신내이름`, "", "", "", "여백");
                                        window[`${i}마신내이름`].innerHTML = 유저.스탯.닉네임;
                                        객체생성(window[`${i}마신내정보`], `${i}마신내체력`, "", "가로꽉", "", "작게");
                                        window[`${i}마신내체력`].innerHTML = `${숫자로만(결과.전투결과.전투로그[i][j].나남은체력)}/${숫자로만(유저.스탯.최종체력)}`;
                                        window[`${i}마신내체력`].style.backgroundColor = 색상맵[`진빨`];
                                        window[`${i}마신내체력`].style.width = `${100 * 결과.전투결과.전투로그[i][j].나남은체력 / 유저.스탯.최종체력}%`;
                                        window[`${i}마신내정보`].style.border = `1px solid ${색상맵[`진파`]}`;

                                        객체생성(window[`${i}마신내정보상대정보`], `${i}마신상대정보`, "플렉스일", "테두리", "세로", "여백");
                                        객체생성(window[`${i}마신상대정보`], `${i}마신상대이름`, "", "", "", "여백");
                                        window[`${i}마신상대이름`].innerHTML = 결과.마신.스탯.닉네임;
                                        객체생성(window[`${i}마신상대정보`], `${i}마신상대체력`, "", "가로꽉", "", "작게");
                                        window[`${i}마신상대체력`].innerHTML = `${숫자로만(결과.전투결과.전투로그[i][j].상대남은체력)}/${숫자로만(결과.마신.스탯.최종체력)}`;
                                        window[`${i}마신상대체력`].style.backgroundColor = 색상맵[`진빨`];
                                        window[`${i}마신상대체력`].style.width = `${100 * 결과.전투결과.전투로그[i][j].상대남은체력 / 결과.마신.스탯.최종체력}%`;
                                        window[`${i}마신상대정보`].style.border = `1px solid ${색상맵[`중빨`]}`;


                                    }
                                }


                            }

                        } else {
                            알림창표시(결과.오류);
                        }

                    } catch (error) {
                        console.log(error);
                    } finally {
                        화면해제();
                    }
                };




            } else {
                알림창표시(결과.오류);
            }

        } catch (error) {
            console.log(error);
        } finally {
        }



    } catch (error) {
        console.log(error);
    } finally {
        화면해제();
    }
}

가글마신전.onclick = async () => {
    try {
        // if (유저.스탯.레벨 < 100) {
        //     알림창표시(`마신전에 문제가 있어 잠시 닫겠습니다`);
        //     return;
        // }
        if (가글마신전컨테이너.style.display === "none") {
            가글마신전화면();
        }
    } catch (error) {
        console.log(error);
    } finally {
        화면해제();
    }
};

객체생성(document.body, "가글광장컨테이너", "사백", "테두리", "세로", "내부", "숨기기");

//가글광장화면함수
async function 가글광장화면() {
    try {
        화면잠금(``);
        가글화면전환(가글광장컨테이너);

        가글광장컨테이너.innerHTML = ``;

        객체생성(가글광장컨테이너, "가글광장설명", "가로꽉", "밑줄", "여백");
        가글광장설명.innerHTML = `정보를 교환하세요`;

        인풋객체생성(가글광장컨테이너, "수다입력", "", "", "여백");
        수다입력.type = "text";
        수다입력.placeholder = "수다 입력";

        수다입력.addEventListener("keydown", async (e) => {
            // 엔터키
            if (e.key === "Enter") {
                try {
                    화면잠금(`수다 입력중입니다`);

                    if (!유저.스탯.현재스태미너) {
                        알림창표시("스태미너가 부족합니다");
                        return;
                    }

                    const 수다내용 = 수다입력.value.trim();

                    if (!수다내용) {
                        알림창표시("수다를 입력하세요");
                        return;
                    }

                    const 응답 = await fetch("/rkrmf", {
                        method: "POST",
                        headers: { "Content-Type": "application/json" },
                        body: JSON.stringify({
                            액션: "수다입력",
                            액션데이터: { 유저id: 유저.id, 수다내용 }
                        })
                    });

                    const 결과 = await 응답.json();

                    if (결과.성공) {
                        알림창표시("수다가 입력되었습니다");

                        가글광장화면();
                    } else {
                        알림창표시(결과.오류);
                    }


                } catch (error) {
                    console.log(error);
                } finally {
                    화면해제();
                }
            }


        });




        try {
            const 응답 = await fetch("/rkrmf", {
                method: "POST",
                headers: { "Content-Type": "application/json" },
                body: JSON.stringify({
                    액션: "광장조회",
                    액션데이터: { 유저id: 유저.id }
                })
            });

            const 결과 = await 응답.json();

            if (결과.성공) {
                window.모든수다 = 결과.data;

                for (const i in 모든수다) {
                    const 항목 = 모든수다[i];
                    const 광장id = 항목.id;

                    // 객체생성(가글광장컨테이너, `광장${광장id}박스`, "세로", "가로꽉", "테두리", "여백");

                    // 객체생성(window[`광장${광장id}박스`], `광장${광장id}이름시간`, "양쪽", "", "");
                    // 객체생성(window[`광장${광장id}이름시간`], `광장${광장id}이름`, "", "", "여백");
                    // window[`광장${광장id}이름`].innerHTML =
                    //     `${항목.스탯.닉넴}`;

                    // if (마신방어1위.스탯.닉네임 === 항목.스탯.닉넴) {
                    //     window[`광장${광장id}이름`].className = `마법의팔레트1위`;
                    // } else if (마신방어2위.스탯.닉네임 === 항목.스탯.닉넴) {
                    //     window[`광장${광장id}이름`].className = `마법의팔레트2위`;

                    // } else if (마신방어3위.스탯.닉네임 === 항목.스탯.닉넴) {
                    //     window[`광장${광장id}이름`].className = `마법의팔레트3위`;

                    // }

                    // if (항목.스탯.닉넴 === "나주인장아니다") {
                    //     window[`광장${광장id}이름`].className = `마법의팔레트주인장`;
                    // }

                    // 객체생성(window[`광장${광장id}이름시간`], `광장${광장id}시간`, "", "", "여백");
                    // window[`광장${광장id}시간`].innerHTML =
                    //     `${항목.스탯.년월} ${항목.스탯.요일} ${항목.스탯.시각}`;

                    // 객체생성(window[`광장${광장id}박스`], `광장${광장id}수다박스`, "양쪽", "", "");
                    // 객체생성(window[`광장${광장id}수다박스`], `광장${광장id}수다`, "", "왼쪽", "여백");
                    // window[`광장${광장id}수다`].innerHTML =
                    //     `${항목.스탯.수다}`;


                    객체생성(가글광장컨테이너, `광장${광장id}박스`, "세로", "가로꽉", "테두리", "여백");

                    객체생성(window[`광장${광장id}박스`], `광장${광장id}이름시간`, "양쪽", "", "");


                    객체생성(window[`광장${광장id}이름시간`], `광장${광장id}이름`, "", "", "여백");
                    window[`광장${광장id}이름`].innerHTML =
                        `${항목.스탯.닉넴}`;

                    객체생성(window[`광장${광장id}이름시간`], `광장${광장id}시간`, "", "", "여백");
                    window[`광장${광장id}시간`].innerHTML =
                        `${항목.스탯.년월} ${항목.스탯.시각}`;


                    if (마신방어1위?.스탯.닉네임 === 항목.스탯.닉넴) {
                        window[`광장${광장id}이름`].className = `마법의팔레트1위`;
                    } else if (마신방어2위?.스탯.닉네임 === 항목.스탯.닉넴) {
                        window[`광장${광장id}이름`].className = `마법의팔레트2위`;

                    } else if (마신방어3위?.스탯.닉네임 === 항목.스탯.닉넴) {
                        window[`광장${광장id}이름`].className = `마법의팔레트3위`;

                    }

                    if (항목.스탯.닉넴 === "나주인장아니다") {
                        window[`광장${광장id}이름`].className = `마법의팔레트주인장`;
                    }


                    객체생성(window[`광장${광장id}박스`], `광장${광장id}수다박스`, "양쪽", "", "");
                    객체생성(window[`광장${광장id}수다박스`], `광장${광장id}수다`, "", "왼쪽", "여백");
                    window[`광장${광장id}수다`].innerHTML =
                        `${항목.스탯.수다}`;




                }
            } else {
                알림창표시(결과.오류);
            }
        } catch (error) {
        } finally {
        }



    } catch (error) {

    } finally {
        화면해제();
    }
}

가글광장.onclick = async () => {
    try {
        if (가글광장컨테이너.style.display === "none") {
            가글광장화면();
        }
    } catch (error) {

    } finally {
        화면해제();
    }
};

객체생성(document.body, "가글우편함컨테이너", "사백", "테두리", "세로", "내부", "숨기기");

//가글우편함화면함수
async function 가글우편함화면() {
    try {
        화면잠금(``);
        가글화면전환(가글우편함컨테이너);

        가글우편함컨테이너.innerHTML = ``;

        객체생성(가글우편함컨테이너, "가글우편함설명", "가로꽉", "밑줄", "여백");
        가글우편함설명.innerHTML = `오늘은 무슨우편이 있으려나요`;


        const 응답 = await fetch("/rkrmf", {
            method: "POST",
            headers: { "Content-Type": "application/json" },
            body: JSON.stringify({
                액션: "우편함조회",
                액션데이터: { 유저id: 유저.id }
            })
        });

        const 결과 = await 응답.json();

        if (결과.성공) {

            서브 = 결과.data;

            if (Object.keys(서브.스탯.우편함).length === 0) {
                객체생성(가글우편함컨테이너, `우편함박스`, "가로꽉", "세로", "테두리", "여백");
                우편함박스.innerHTML = `우편함이 비었습니다`;

            }

            for (const a in 서브.스탯.우편함) {
                객체생성(가글우편함컨테이너, `${a}박스`, "가로꽉", "세로", "테두리", "여백");
                객체생성(window[`${a}박스`], `${a}일행`, "양쪽", "", "밑줄");
                객체생성(window[`${a}일행`], `${a}일행좌`, "", "", "여백");
                window[`${a}일행좌`].innerHTML = `${서브.스탯.우편함[a].년월}`;

                객체생성(window[`${a}일행`], `${a}일행중`, "", "", "여백");
                window[`${a}일행중`].innerHTML = `${서브.스탯.우편함[a].이름} ×${숫자한글(서브.스탯.우편함[a].수량)}`;

                객체생성(window[`${a}일행`], `${a}일행우`, "여백", "버튼", "테두리");
                window[`${a}일행우`].innerHTML = `받기`;

                객체생성(window[`${a}박스`], `${a}이행`, "왼쪽", "", "여백");
                window[`${a}이행`].innerHTML =
                    맵핑[서브.스탯.우편함[a].이름]?.() ?? "효과없음";


                객체생성(window[`${a}박스`], `${a}삼행`, "오른쪽", "", "여백");
                window[`${a}삼행`].innerHTML = `${서브.스탯.우편함[a].메모}`;


                객체생성(window[`${a}이행`], `${a}이행좌`, "플렉스일", "오른쪽", "여백");


                window[`${a}일행우`].onclick = async () => {
                    try {
                        화면잠금();

                        if (서브.스탯.우편함[a].이름 === "햄버거") {
                            if (유저.스탯.현재스태미너 >= 2000 - (서브.스탯.우편함[a].수량 * 300)) {
                                알림창표시(`스태미너를 더 소모하고 사용하세요`);
                                return;
                            }
                        }
                        if (서브.스탯.우편함[a].이름 === "샐러드") {
                            if (유저.스탯.현재스태미너 >= 2000 - (서브.스탯.우편함[a].수량 * 60)) {
                                알림창표시(`스태미너를 더 소모하고 사용하세요`);
                                return;
                            }
                        }
                        if (서브.스탯.우편함[a].이름 === "스태미너") {
                            if (유저.스탯.현재스태미너 >= 2000 - (서브.스탯.우편함[a].수량)) {
                                알림창표시(`스태미너를 더 소모하고 사용하세요`);
                                return;
                            }
                        }
                        const 응답 = await fetch("/rkrmf", {
                            method: "POST",
                            headers: { "Content-Type": "application/json" },
                            body: JSON.stringify({
                                액션: "우편받기",
                                액션데이터: { 유저id: 유저.id, 우편번호: a }
                            })
                        });

                        const 결과 = await 응답.json();

                        if (결과.성공) {

                            유저 = 결과.가글;
                            서브 = 결과.서브;

                            가글우편함화면();

                            알림창표시("우편을 수령했습니다");

                        } else {
                            알림창표시(결과.오류);
                        }

                    } catch (error) {

                    } finally {
                        화면해제();
                    }
                };



            }


        } else {
            알림창표시(결과.오류);
        }




    } catch (error) {

    } finally {
        화면해제();
    }
}

가글우편함.onclick = async () => {
    try {
        if (가글우편함컨테이너.style.display === "none") {
            가글우편함화면();
        }
    } catch (error) {

    } finally {
        화면해제();
    }
};


객체생성(document.body, "가글영혼컨테이너", "사백", "테두리", "세로", "내부", "숨기기");

//가글영혼화면함수
async function 가글영혼화면() {
    try {
        화면잠금(``);
        가글화면전환(가글영혼컨테이너);

        가글영혼컨테이너.innerHTML = ``;

        객체생성(가글영혼컨테이너, "가글영혼설명", "가로꽉", "밑줄", "여백");
        가글영혼설명.innerHTML = `
        각 층에서 흡수(드랍률 1%)된 영혼들은 다음층 악마들의<br>
        스탯을 감소시킵니다<br>
        `;

        window.흡수영혼 = 0;
        for (const a in 유저.스탯.영혼) {
            if (유저.스탯.영혼[a]) {
                흡수영혼++;
                객체생성(가글영혼컨테이너, `영혼박스${a}`, "가로꽉", "세로", "테두리", "여백");

                객체생성(window[`영혼박스${a}`], `영혼수량${a}`, "밑줄", "왼쪽", "여백");
                window[`영혼수량${a}`].innerHTML = `${a}층 악마의 영혼 (${유저.스탯.영혼[a]}/999)`;
                window[`영혼수량${a}`].color = 등급[a].색상;

                객체생성(window[`영혼박스${a}`], `영혼효과${a}`, "", "오른쪽", "여백");
                window[`영혼효과${a}`].innerHTML = `${+a + 1}층 악마들의 최종스탯 ×${1 - 유저.스탯.영혼[a] * 0.001}`;

            }

        }

        if (!흡수영혼) {
            객체생성(가글영혼컨테이너, `흡수영혼없음`, "가로꽉", "세로", "테두리", "여백");
            흡수영혼없음.innerHTML = `흡수된 영혼이 없습니다..`;

        }



    } catch (error) {

    } finally {
        화면해제();
    }
}

가글영혼.onclick = async () => {
    try {
        if (가글영혼컨테이너.style.display === "none") {
            가글영혼화면();
        }
    } catch (error) {

    } finally {
        화면해제();
    }
};

객체생성(document.body, "가글버프컨테이너", "사백", "테두리", "세로", "내부", "숨기기");

//가글버프화면함수
async function 가글버프화면() {
    try {
        화면잠금(``);
        가글화면전환(가글버프컨테이너);

        가글버프컨테이너.innerHTML = ``;

        객체생성(가글버프컨테이너, "가글버프설명", "가로꽉", "밑줄", "여백");
        가글버프설명.innerHTML = `
        버프는 깡스탯, 보너스스탯, 보너스스킬로 총 3종입니다<br>
        깡스탯은 전투화면에 바로 적용되어 표시됩니다<br>
        보너스스탯도 전투화면에 최종스탯으로 적용되어 표시되지만<br>
        유물화면에 표시되지는 않습니다(유물스탯과합연산)<br>
        보너스 스킬은 실제 전투가 이뤄지는 순간에 적용되기에<br>
        전투로그로만 확인하실 수 있습니다<br>
        리롤 최댓값은 접속일차에 따라 매일 증가합니다<br>
        깡스탯과 보너스스탯의 최대접속일은 100일이며,<br>
        보너스스킬의 최댓값은 9일로 계산됩니다<br>
        `;

        객체생성(가글버프컨테이너, "버프리롤범위", "가로꽉", "밑줄", "");
        객체생성(버프리롤범위, "깡범위", "플렉스일", "세로", "여백", "테두리오른쪽");
        객체생성(깡범위, "깡공", "", "양쪽", "");
        객체생성(깡공, "깡공일열", "", "", "");
        깡공일열.innerHTML = `공격력`;
        객체생성(깡공, "깡공이열", "", "", "");
        깡공이열.innerHTML = `${버프범위[0][0](유저.스탯.n일차)[0]} ~ ${버프범위[0][0](유저.스탯.n일차)[1]}`;

        객체생성(깡범위, "깡방", "", "양쪽", "");
        객체생성(깡방, "깡방일열", "", "", "");
        깡방일열.innerHTML = `방어력`;
        객체생성(깡방, "깡방이열", "", "", "");
        깡방이열.innerHTML = `${버프범위[0][1](유저.스탯.n일차)[0]} ~ ${버프범위[0][1](유저.스탯.n일차)[1]}`;

        객체생성(깡범위, "깡체", "", "양쪽", "");
        객체생성(깡체, "깡체일열", "", "", "");
        깡체일열.innerHTML = `체력`;
        객체생성(깡체, "깡체이열", "", "", "");
        깡체이열.innerHTML = `${버프범위[0][2](유저.스탯.n일차)[0]} ~ ${버프범위[0][2](유저.스탯.n일차)[1]}`;

        객체생성(버프리롤범위, "보너스범위", "플렉스일", "세로", "여백", "테두리오른쪽");
        객체생성(보너스범위, "보너스범위일열", "양쪽", "", "");

        객체생성(보너스범위일열, "보너스범위일열일행", "", "", "");
        보너스범위일열일행.innerHTML = `보너스`;
        객체생성(보너스범위일열, "보너스범위일열이행", "", "", "");
        보너스범위일열이행.innerHTML = `${버프범위[1][1](유저.스탯.n일차)[0]} ~ ${버프범위[1][1](유저.스탯.n일차)[1]}`;


        객체생성(버프리롤범위, "스킬범위", "플렉스일", "세로", "여백");
        객체생성(스킬범위, "스킬범위일열", "양쪽", "", "");

        객체생성(스킬범위일열, "스킬범위일열일행", "", "", "");
        스킬범위일열일행.innerHTML = `스킬`;
        객체생성(스킬범위일열, "스킬범위일열이행", "", "", "");
        스킬범위일열이행.innerHTML = `${버프범위[2][1](유저.스탯.n일차)[0]} ~ ${버프범위[2][1](유저.스탯.n일차)[1]}`;




        for (const a in 유저.스탯.오늘의버프) {
            객체생성(가글버프컨테이너, `버프${a}`, "세로", "가로꽉", "테두리", "여백");
            객체생성(window[`버프${a}`], `버프${a}일행`, "", "양쪽", "밑줄");
            객체생성(window[`버프${a}일행`], `버프${a}일행일열`, "", "", "여백");
            window[`버프${a}일행일열`].innerHTML = `오늘의 ${+a + 1}번째 버프`;
            객체생성(window[`버프${a}일행`], `버프${a}일행이열`, "버튼", "테두리", "여백");
            window[`버프${a}일행이열`].innerHTML = `리롤(비용:스태미너1)`;

            window[`버프${a}일행이열`].onclick = async () => {
                try {
                    화면잠금();

                    if (!유저.스탯.현재스태미너) {
                        알림창표시(`스태미너가 부족합니다`);
                        return;
                    }

                    const 응답 = await fetch("/rkrmf", {
                        method: "POST",
                        headers: { "Content-Type": "application/json" },
                        body: JSON.stringify({
                            액션: "버프리롤",
                            액션데이터: { 유저id: 유저.id, 버프번호: +a, }
                        })
                    });

                    const 결과 = await 응답.json();

                    if (결과.성공) {

                        유저 = 결과.data;

                        가글버프화면();

                        알림창표시(`오늘의 ${+a + 1}번째 버프 리롤!`);

                    } else {
                        알림창표시(결과.오류);
                    }

                } catch (error) {

                } finally {
                    화면해제();
                }
            };

            let 결과 = null;

            for (const 종류 in 유저.스탯.오늘의버프[a]) {
                for (const 키 in 유저.스탯.오늘의버프[a][종류]) {
                    const 값 = 유저.스탯.오늘의버프[a][종류][키];
                    if (값) {
                        결과 = { 종류, 키, 값 };
                        break;
                    }
                }
                if (결과) break;
            }

            객체생성(window[`버프${a}`], `버프${a}이행`, "", "양쪽", "");
            객체생성(window[`버프${a}이행`], `버프${a}이행일열`, "", "", "여백");
            window[`버프${a}이행일열`].innerHTML = 버프모음?.[결과?.종류]?.[결과?.키] ?? "???";

            객체생성(window[`버프${a}`], `버프${a}삼행`, "", "양쪽", "");
            객체생성(window[`버프${a}삼행`], `버프${a}삼행일열`, "", "", "여백");
            window[`버프${a}삼행일열`].innerHTML = ``;
            객체생성(window[`버프${a}삼행`], `버프${a}삼행이열`, "", "", "여백");
            window[`버프${a}삼행이열`].innerHTML = `+ ${결과?.값 ?? "???"}`;

        }

    } catch (error) {
        console.error("위치:", error.stack);
        console.error("메시지:", error.message);

    } finally {
        화면해제();
    }
}

가글버프.onclick = async () => {
    try {
        if (가글버프컨테이너.style.display === "none") {
            가글버프화면();
        }
    } catch (error) {

    } finally {
        화면해제();
    }
};

객체생성(document.body, "가글상점컨테이너", "사백", "테두리", "세로", "내부", "숨기기");

//가글상점화면함수
async function 가글상점화면() {
    try {
        화면잠금(``);
        가글화면전환(가글상점컨테이너);

        가글상점컨테이너.innerHTML = ``;

        객체생성(가글상점컨테이너, "가글상점설명", "가로꽉", "밑줄", "여백");
        가글상점설명.innerHTML = `
        골드가 쌓이고 계신가요?<br>
        악마성 증축을 위해 물건을 구매해주세요<br>
        ☠️주의. 도박은 패가망신의 지름길입니다☠️<br>
        `

        객체생성(가글상점컨테이너, "상점보유골드", "가로꽉", "밑줄", "여백", "오른쪽");
        상점보유골드.innerHTML = `보유Gold ${숫자한글(유저.스탯.현재골드)}`

        for (const a in 상점모음) {
            객체생성(가글상점컨테이너, `상점${a}`, "가로꽉", "테두리", "여백", "세로");
            객체생성(window[`상점${a}`], `상점${a}1`, "", "", "양쪽", "밑줄");
            객체생성(window[`상점${a}1`], `상점${a}11`, "", "", "", "여백");
            window[`상점${a}11`].innerHTML = `${상점모음[a].이름}`;

            객체생성(window[`상점${a}1`], `상점${a}12`, "", "테두리", "버튼", "여백");
            window[`상점${a}12`].innerHTML = `${상점모음[a].금액}`;

            window[`상점${a}12`].onclick = async () => {
                try {
                    화면잠금();

                    if (유저.스탯.현재골드 < 상점모음[a].실제금액) {
                        알림창표시(`골드가 부족합니다`);
                        return;
                    }

                    if (+a === 0) {
                        if (유저.스탯.현재스태미너 > 1800) {
                            알림창표시(`스태미너를 소모한 뒤 구매하세요`);
                            return;
                        }
                    } else if (+a === 1) {
                        if (유저.스탯.현재스태미너 > 1940) {
                            알림창표시(`스태미너를 소모한 뒤 구매하세요`);
                            return;
                        }
                    }


                    const 응답 = await fetch("/rkrmf", {
                        method: "POST",
                        headers: { "Content-Type": "application/json" },
                        body: JSON.stringify({
                            액션: "상점구매",
                            액션데이터: { 유저id: 유저.id, 품목: +a }
                        })
                    });

                    const 결과 = await 응답.json();

                    if (결과.성공) {

                        유저 = 결과.data;

                        가글상점화면();
                        알림창표시(`스태미너 ${결과.획득스태미너} 획득!`);

                    } else {
                        알림창표시(결과.오류);
                    }

                } catch (error) {

                } finally {
                    화면해제();
                }
            };

            객체생성(window[`상점${a}`], `상점${a}2`, "", "", "양쪽", "");
            객체생성(window[`상점${a}2`], `상점${a}21`, "", "", "", "여백");
            객체생성(window[`상점${a}2`], `상점${a}22`, "", "", "", "여백");
            window[`상점${a}22`].innerHTML = `${상점모음[a].설명}`;


        }

    } catch (error) {
        console.error("위치:", error.stack);
        console.error("메시지:", error.message);

    } finally {
        화면해제();
    }
}

가글상점.onclick = async () => {
    try {
        if (가글상점컨테이너.style.display === "none") {
            가글상점화면();
        }
    } catch (error) {

    } finally {
        화면해제();
    }
};

객체생성(document.body, "가글커뮤니티컨테이너", "사백", "테두리", "세로", "내부", "숨기기");

//가글커뮤니티화면함수
async function 가글커뮤니티화면() {
    try {
        화면잠금(``);
        가글화면전환(가글커뮤니티컨테이너);

        가글커뮤니티컨테이너.innerHTML = ``;

        객체생성(가글커뮤니티컨테이너, "가글커뮤니티설명", "가로꽉", "밑줄", "여백");
        가글커뮤니티설명.innerHTML = `
        광장이 답답하신 분들은 단톡에 오셔서 정보를 교환해보세요<br>
        `;

        객체생성(가글커뮤니티컨테이너, "커뮤니티1", "가로꽉", "테두리", "여백");
        커뮤니티1.innerHTML = `
        <a href="https://open.kakao.com/o/gbnmdWvh" target="_blank" style="color:#4FC1FF;">
        https://open.kakao.com/o/gbnmdWvh
        </a><br>
        `;


    } catch (error) {
        console.error("위치:", error.stack);
        console.error("메시지:", error.message);

    } finally {
        화면해제();
    }
}

가글커뮤니티.onclick = async () => {
    try {
        if (가글커뮤니티컨테이너.style.display === "none") {
            가글커뮤니티화면();
        }
    } catch (error) {

    } finally {
        화면해제();
    }
};

객체생성(document.body, "가글보스컨테이너", "사백", "테두리", "세로", "내부", "숨기기");

//가글보스화면함수
async function 가글보스화면() {
    try {
        화면잠금(``);
        가글화면전환(가글보스컨테이너);

        가글보스컨테이너.innerHTML = ``;

        객체생성(가글보스컨테이너, "가글보스설명", "가로꽉", "밑줄", "여백");
        가글보스설명.innerHTML = `
        구현중입니다<br>
        `

        // 객체생성(가글보스컨테이너, "보스보유골드", "가로꽉", "밑줄", "여백", "오른쪽");
        // 보스보유골드.innerHTML = `보유Gold ${숫자한글(유저.스탯.현재골드)}`

        // for (const a in 보스모음) {
        //     객체생성(가글보스컨테이너, `보스${a}`, "가로꽉", "테두리", "여백", "세로");
        //     객체생성(window[`보스${a}`], `보스${a}1`, "", "", "양쪽", "밑줄");
        //     객체생성(window[`보스${a}1`], `보스${a}11`, "", "", "", "여백");
        //     window[`보스${a}11`].innerHTML = `${보스모음[a].이름}`;

        //     객체생성(window[`보스${a}1`], `보스${a}12`, "", "테두리", "버튼", "여백");
        //     window[`보스${a}12`].innerHTML = `${보스모음[a].금액}`;

        //     window[`보스${a}12`].onclick = async () => {
        //         try {
        //             화면잠금();

        //             if (유저.스탯.현재골드 < 보스모음[a].실제금액) {
        //                 알림창표시(`골드가 부족합니다`);
        //                 return;
        //             }

        //             if (+a === 0) {
        //                 if (유저.스탯.현재스태미너 > 1800) {
        //                     알림창표시(`스태미너를 소모한 뒤 구매하세요`);
        //                     return;
        //                 }
        //             } else if (+a === 1) {
        //                 if (유저.스탯.현재스태미너 > 1940) {
        //                     알림창표시(`스태미너를 소모한 뒤 구매하세요`);
        //                     return;
        //                 }
        //             }


        //             const 응답 = await fetch("/rkrmf", {
        //                 method: "POST",
        //                 headers: { "Content-Type": "application/json" },
        //                 body: JSON.stringify({
        //                     액션: "보스구매",
        //                     액션데이터: { 유저id: 유저.id, 품목: +a }
        //                 })
        //             });

        //             const 결과 = await 응답.json();

        //             if (결과.성공) {

        //                 유저 = 결과.data;

        //                 가글보스화면();
        //                 알림창표시(`스태미너 ${결과.획득스태미너} 획득!`);

        //             } else {
        //                 알림창표시(결과.오류);
        //             }

        //         } catch (error) {

        //         } finally {
        //             화면해제();
        //         }
        //     };

        //     객체생성(window[`보스${a}`], `보스${a}2`, "", "", "양쪽", "");
        //     객체생성(window[`보스${a}2`], `보스${a}21`, "", "", "", "여백");
        //     객체생성(window[`보스${a}2`], `보스${a}22`, "", "", "", "여백");
        //     window[`보스${a}22`].innerHTML = `${보스모음[a].설명}`;


        // }

    } catch (error) {
        console.error("위치:", error.stack);
        console.error("메시지:", error.message);

    } finally {
        화면해제();
    }
}

가글보스.onclick = async () => {
    try {
        if (가글보스컨테이너.style.display === "none") {
            가글보스화면();
        }
    } catch (error) {

    } finally {
        화면해제();
    }
};

//시작화면
const 화면목록 = [
    { 이름: "메뉴얼", 실행: 가글메뉴얼화면 },
    { 이름: "패치노트", 실행: 가글패치노트화면 },
    { 이름: "전투", 실행: 가글전투화면 },
    { 이름: "설정", 실행: 가글설정화면 },
    { 이름: "장비", 실행: 가글장비화면 },
    { 이름: "일어난일", 실행: 가글일어난일화면 },
    { 이름: "전당", 실행: 가글전당화면 },
    { 이름: "유물", 실행: 가글유물화면 },
    { 이름: "스킬", 실행: 가글스킬화면 },
    { 이름: "마신전", 실행: 가글마신전화면 },
    { 이름: "광장", 실행: 가글광장화면 },
    { 이름: "우편함", 실행: 가글우편함화면 },
    { 이름: "영혼", 실행: 가글영혼화면 },
    { 이름: "버프", 실행: 가글버프화면 },
    { 이름: "상점", 실행: 가글상점화면 },
    { 이름: "커뮤니티", 실행: 가글커뮤니티화면 },
    { 이름: "보스", 실행: 가글보스화면 },
];

//가글화면전환함수 화면추가
function 가글화면전환(화면이름) {
    const 화면들 = [
        게임선택컨테이너,
        가글로그인컨테이너,
        가글패치노트컨테이너,
        가글전투컨테이너,
        가글설정컨테이너,
        가글정보툴팁,
        가글성장툴팁,
        가글월드툴팁,
        가글주인장컨테이너,
        가글메뉴얼컨테이너,
        가글장비컨테이너,
        가글일어난일컨테이너,
        가글전당컨테이너,
        가글유물컨테이너,
        가글스킬컨테이너,
        가글마신전컨테이너,
        가글광장컨테이너,
        가글우편함컨테이너,
        가글영혼컨테이너,
        가글버프컨테이너,
        가글상점컨테이너,
        가글커뮤니티컨테이너,
        가글보스컨테이너,
    ];

    for (let el of 화면들) {
        el.style.display = "none";
    }

    화면이름.style.display = "flex";
}

//단축키설정
document.addEventListener("keydown", async function (e) {
    자동플래그 = 0;
    if (
        document.activeElement &&
        document.activeElement.tagName === "INPUT"
    ) {
        return;
    }

    if (게임선택컨테이너.style.display === "flex") {
        switch (e.key) {
            case "1":
                가글.click();
                break;
            case "2":
                삼국맨.click();
                break;
        }
    }

    if (팝업컨테이너.style.display === "flex") {
        switch (e.key) {
            case "Enter":
                팝업확인.onclick();
                break;
            case " ":
                팝업확인.onclick();
                break;
        }
    }

    if (가글메뉴들.style.display === "flex") {
        switch (e.key) {
            case "q":
                가글계정삭제.onclick(e);
                break;
            case "w":
                가글로그아웃.onclick(e);
                break;
            case "e":
                if (가글패치노트컨테이너.style.display === "none") {
                    가글패치노트.onclick();
                }
                break;
            case "r":
                if (가글전투컨테이너.style.display === "none") {
                    가글전투.onclick();
                }
                break;
            case "t":
                if (가글설정컨테이너.style.display === "none") {
                    가글설정.onclick();
                }
                break;
            case "y":
                if (가글메뉴얼컨테이너.style.display === "none") {
                    가글메뉴얼.onclick();
                }
                break;
            case "u":
                if (가글장비컨테이너.style.display === "none") {
                    가글장비.onclick();
                }
                break;
            case "i":
                if (가글일어난일컨테이너.style.display === "none") {
                    가글일어난일.onclick();
                }
                break;
            case "o":
                if (가글전당컨테이너.style.display === "none") {
                    가글전당.onclick();
                }
                break;
            case "p":
                if (가글유물컨테이너.style.display === "none") {
                    가글유물.onclick();
                }
                break;
            case "a":
                if (가글스킬컨테이너.style.display === "none") {
                    가글스킬.onclick();
                }
                break;
            case "s":
                if (가글마신전컨테이너.style.display === "none") {
                    가글마신전.onclick();
                }
                break;
            case "d":
                if (가글광장컨테이너.style.display === "none") {
                    가글광장.onclick();
                }
                break;
            case "f":
                if (가글우편함컨테이너.style.display === "none") {
                    가글우편함.onclick();
                }
                break;
            case "g":
                if (가글영혼컨테이너.style.display === "none") {
                    가글영혼.onclick();
                }
                break;
            case "h":
                if (가글버프컨테이너.style.display === "none") {
                    가글버프.onclick();
                }
                break;
            case "j":
                if (가글상점컨테이너.style.display === "none") {
                    가글상점.onclick();
                }
                break;
            case "k":
                if (가글커뮤니티컨테이너.style.display === "none") {
                    가글커뮤니티.onclick();
                }
                break;
            case "l":
                if (가글보스컨테이너.style.display === "none") {
                    가글보스.onclick();
                }
                break;
        }
    }
});

//클릭이벤트
document.addEventListener("click", async (e) => {

    if (!팝업컨테이너.contains(e.target) && 팝업컨테이너.style.display === "flex") {
        팝업취소.onclick();
    }

    미니정보창컨테이너.style.display = "none";
    //    if (!미니정보창컨테이너.contains(e.target) && 미니정보창컨테이너.style.display === "flex") {
    //     }

    if (!e.target.matches("#반자동") && !e.target.matches("#풀자동") && !e.target.matches("#무자동")) {
        자동플래그 = 0;
    }


});

function 숫자로만(n) {
    return n.toLocaleString("ko-KR");
}

function 숫자한글(n) {
    if (n < 10000) {
        return n.toLocaleString("ko-KR");
    }

    if (n < 100000000) {
        return (Math.floor((n / 10000) * 100) / 100) + "만";
    }

    if (n < 1000000000000) {
        return (Math.floor((n / 100000000) * 100) / 100) + "억";
    }

    if (n < 10000000000000000) {
        return (Math.floor((n / 1000000000000) * 100) / 100) + "조";
    }

    return (Math.floor((n / 10000000000000000) * 100) / 100) + "경";
}







// 객체생성(document.body, "가글새로운컨테이너", "사백", "테두리", "세로", "내부", "숨기기");

// //가글새로운화면함수
// async function 가글새로운화면() {
//     try {
//         화면잠금(``);
//         가글화면전환(가글새로운컨테이너);

//         가글새로운컨테이너.innerHTML = ``;

//         객체생성(가글새로운컨테이너, "가글새로운설명", "가로꽉", "밑줄", "여백");
//         가글새로운설명.innerHTML = `아이디는 한글만 가능합니다`;

//         객체생성(가글새로운컨테이너, "새로운박스", "가로꽉", "세로", "");

//         새로운박스.onclick = async () => {
//             try {
//                 화면잠금();

//                 if (window.가글자동가글새로운) {
//                     알림창표시(`자동가글새로운중입니다`);
//                     return;
//                 }

//                 const 응답 = await fetch("/rkrmf", {
//                     method: "POST",
//                     headers: { "Content-Type": "application/json" },
//                     body: JSON.stringify({
//                         액션: "새로운",
//                         액션데이터: { 유저id: 유저.id }
//                     })
//                 });

//                 const 결과 = await 응답.json();

//                 if (결과.성공) {

//                     유저 = 결과.data;

//                     가글새로운화면();

//                     알림창표시("가글새로운되었습니다");

//                 } else {
//                     알림창표시(결과.오류);
//                 }

//             } catch (error) {

//             } finally {
//                 화면해제();
//             }
//         };

//     } catch (error) {

//     } finally {
//         화면해제();
//     }
// }

// 가글새로운.onclick = async () => {
//     try {
//         if (가글새로운컨테이너.style.display === "none") {
//             가글새로운화면();
//         }
//     } catch (error) {

//     } finally {
//         화면해제();
//     }
// };


















//삼국맨함수
삼국맨.onclick = async () => {
    알림창표시(`아직 구상중인 게임입니다`);

};

